sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/*!
    \file    gd32a7xx_adc.h
    \brief   definitions for the ADC

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_ADC_H
#define GD32A7XX_ADC_H

#include "gd32a7xx.h"

/* ADC definitions */
#define ADC0                            ADC_BASE
#define ADC1                            (ADC_BASE + 0x00000800U)
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define ADC2                            (ADC_BASE + 0x00003400U)
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* registers definitions */
/* ADC global registers */
#define ADC_CTL(adcx)                   REG32((adcx) + 0x00000000U)                                  /*!< ADC control register */
#define ADC_STAT(adcx)                  REG32((adcx) + 0x00000004U)                                  /*!< ADC status register */
#define ADC_ESTAT(adcx)                 REG32((adcx) + 0x00000008U)                                  /*!< ADC error status register */
#define ADC_WDTx(adcx, x)               REG32((adcx) + (0x0000000CU + (x)*4U))                          /*!< ADC watchdog threshold register(x = 0~3) */
#define ADC_PSMPCFG(adcx)               REG32((adcx) + 0x0000001CU)                                  /*!< ADC presampling time configure register */
#define ADC_CHCFGx(adcx, x)             REG32((adcx) + (0x00000020U + (x)*4U))                          /*!< ADC channel configure register(x = 0~61) */
#define ADC_WDINTF0(adcx)               REG32((adcx) + 0x00000118U)                                  /*!< ADC watchdog interrupt flag register 0 */
#define ADC_WDINTF1(adcx)               REG32((adcx) + 0x0000011CU)                                  /*!< ADC watchdog interrupt flag register 1 */
#define ADC_EDDLY(adcx)                 REG32((adcx) + 0x00000120U)                                  /*!< ADC external decode delay register */
#define ADC_CSDLY(adcx)                 REG32((adcx) + 0x00000124U)                                  /*!< ADC conversion start delay register */
#define ADC_GAINCFG(adcx)               REG32((adcx) + 0x00000128U)                                  /*!< ADC gain configure register */
#define ADC_OFFCFGx(adcx, x)            REG32((adcx) + (0x0000012CU + (x)*4U))                          /*!< ADC offset configure register(x = 0~3) */
#define ADC_SYNCCTL                     REG32(ADC0 + 0x0000013CU)                                    /*!< ADC sync control register(only ADC0) */
/* ADC routine sequence registers */
#define ADC_RCTL(adcx)                  REG32((adcx) + 0x00000200U)                                  /*!< ADC routine sequence control register */
#define ADC_RSTREAM(adcx)               REG32((adcx) + 0x00000204U)                                  /*!< ADC routine sequence stream register */
#define ADC_RCFGx(adcx, x)              REG32((adcx) + (0x00000208U + (x)*4U))                          /*!< ADC routine sequence configure register(x = 0~27) */
#define ADC_RCHINF(adcx)                REG32((adcx) + 0x00000278U)                                  /*!< ADC routine sequence  channel conversion end interrupt flag register */
#define ADC_RCHDATAx(adcx, x)           REG32((adcx) + (0x0000027CU + (x)*4U))                          /*!< ADC routine sequence channel data register(x = 0~27) */
#define ADC_RDATA(adcx)                 REG32((adcx) + 0x000002ECU)                                  /*!< ADC routine sequence data register */
/* ADC inserted sequence registers */
#define ADC_IxCTL(adcx, x)              REG32((adcx) + (0x00000300U + (x)*0x50U))                       /*!< ADC inserted sequence x control register(x = 0~5) */
#define ADC_IxSTREAM(adcx, x)           REG32((adcx) + (0x00000304U + (x)*0x50U))                       /*!< ADC inserted sequence x stream register(x = 0~5) */
#define ADC_IxCFGy(adcx, x, y)          REG32((adcx) + (0x00000308U + (x)*0x50U + (y)*4U))                 /*!< ADC inserted sequence x configure register(x = 0~5, y = 0~3) */
#define ADC_IxCHINTF(adcx, x)           REG32((adcx) + (0x00000318U + (x)*0x50U))                       /*!< ADC inserted sequence x channel conversion end interrupt flag register(x = 0~5) */
#define ADC_IxCHDATAy(adcx, x, y)       REG32((adcx) + (0x0000031CU + (x)*0x50U + (y)*4U))                 /*!< ADC inserted sequence x channel data register y(x = 0~5, y = 0~3) */
#define ADC_IxDATA(adcx, x)             REG32((adcx) + (0x0000032CU + (x)*0x50U))                       /*!< ADC inserted sequence x data register(x = 0~5) */
/* ADC selftest registers */
#define ADC_STSAMPT(adcx)               REG32((adcx) + 0x00000600U)                                  /*!< ADC selftest sample time register */
#define ADC_STINTEN(adcx)               REG32((adcx) + 0x00000604U)                                  /*!< ADC selftest interrupt enable register */
#define ADC_STCFG(adcx)                 REG32((adcx) + 0x00000608U)                                  /*!< ADC selftest configure register */
#define ADC_STSTAT(adcx)                REG32((adcx) + 0x0000060CU)                                  /*!< ADC selftest status register */
#define ADC_STEDATA0(adcx)              REG32((adcx) + 0x00000610U)                                  /*!< ADC selftest error data register 0 */
#define ADC_STEDATA1(adcx)              REG32((adcx) + 0x00000614U)                                  /*!< ADC selftest error data register 1 */
#define ADC_STDATA(adcx)                REG32((adcx) + 0x00000618U)                                  /*!< ADC selftest conversion data register */
#define ADC_SSTWDCFGx(adcx, x)          REG32((adcx) + (0x0000061CU + (x)*4U))                          /*!< ADC watchdog for supply selftest step register(x = 0~2) */
#define ADC_CSTWDCFGx(adcx, x)          REG32((adcx) + (0x00000628U + (x)*4U))                          /*!< ADC watchdog for capacitive selftest step register(x = 0~3) */
#define ADC_DTALTCFG(adcx)              REG32((adcx) + 0x00000638U)                                  /*!< DAC - ADC loop test register */

