sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* bits definitions */
/* ADC_CTL */
#define ADC_CTL_ADCON                   BIT(0)                                                       /*!< ADC on */
#define ADC_CTL_AVRGEN                  BIT(2)                                                       /*!< averaging function enable */
#define ADC_CTL_AVRGSEL                 BITS(3,5)                                                    /*!< averaging conversion number selection */
#define ADC_CTL_DMA                     BIT(8)                                                       /*!< dma request enable */
#define ADC_CTL_DAL                     BIT(9)                                                       /*!< data alignment */
#define ADC_CTL_OVWIE                   BIT(10)                                                      /*!< sequence overwrite interrupt enable */
#define ADC_CTL_CHOVWIE                 BIT(11)                                                      /*!< channel overwrite interrupt enable */
#define ADC_CTL_OVWEN                   BIT(12)                                                      /*!< overwrite enable */
#define ADC_CTL_DRES                    BITS(13,14)                                                  /*!< ADC data resolution */
#define ADC_CTL_GAINEN                  BIT(15)                                                      /*!< gain mode enable */
#define ADC_CTL_CKAUTO                  BIT(16)                                                      /*!< clock auto off */
#define ADC_CTL_CALMOD                  BIT(18)                                                      /*!< ADC calibration mode */
#define ADC_CTL_CLB                     BIT(19)                                                      /*!< ADC calibration */
#define ADC_CTL_RSTCLB                  BIT(20)                                                      /*!< reset calibration */
#define ADC_CTL_CALNUM                  BITS(21,23)                                                  /*!< calibration times */
#define ADC_CTL_STLK                    BIT(24)                                                      /*!< selftest register lock */
#define ADC_CTL_HPTSVEN                 BIT(30)                                                      /*!< high-precision temperatue sensor enable */
#define ADC_CTL_INREFEN                 BIT(31)                                                      /*!< internal reference voltage enable */

/* ADC_STAT */
#define ADC_STAT_ADCSTAT                BITS(0,2)                                                    /*!< ADC state */
#define ADC_STAT_ACTSQ                  BITS(3,5)                                                    /*!< active sequence status */
#define ADC_STAT_ACTST                  BIT(6)                                                       /*!< active self test status */
#define ADC_STAT_ACTCH                  BITS(8,13)                                                   /*!< active channel status */
#define ADC_STAT_EORC                   BIT(16)                                                      /*!< end of routine sequence conversion */
#define ADC_STAT_EOI0C                  BIT(17)                                                      /*!< end of inserted sequence 0 conversion */
#define ADC_STAT_EOI1C                  BIT(18)                                                      /*!< end of inserted sequence 1 conversion */
#define ADC_STAT_EOI2C                  BIT(19)                                                      /*!< end of inserted sequence 2 conversion */
#define ADC_STAT_EOI3C                  BIT(20)                                                      /*!< end of inserted sequence 3 conversion */
#define ADC_STAT_EOI4C                  BIT(21)                                                      /*!< end of inserted sequence 4 conversion */
#define ADC_STAT_EOI5C                  BIT(22)                                                      /*!< end of inserted sequence 5 conversion */
#define ADC_STAT_EORCHC                 BIT(24)                                                      /*!< end of routine sequence channel conversion */
#define ADC_STAT_EOI0CHC                BIT(25)                                                      /*!< end of inserted sequence 0 channel conversion */
#define ADC_STAT_EOI1CHC                BIT(26)                                                      /*!< end of inserted sequence 1 channel conversion */
#define ADC_STAT_EOI2CHC                BIT(27)                                                      /*!< end of inserted sequence 2 channel conversion */
#define ADC_STAT_EOI3CHC                BIT(28)                                                      /*!< end of inserted sequence 3 channel conversion */
#define ADC_STAT_EOI4CHC                BIT(29)                                                      /*!< end of inserted sequence 4 channel conversion */
#define ADC_STAT_EOI5CHC                BIT(30)                                                      /*!< end of inserted sequence 5 channel conversion */

/* ADC_ESTAT */
#define ADC_ESTAT_RSUSPDF               BIT(0)                                                       /*!< routine sequence suspended flag */
#define ADC_ESTAT_RABORTF               BIT(1)                                                       /*!< routine sequence aborted flag */
#define ADC_ESTAT_RTRGE                 BIT(2)                                                       /*!< routine sequence trigger error */
#define ADC_ESTAT_I0SUSPDF              BIT(4)                                                       /*!< inserted sequence 0 suspended flag */
#define ADC_ESTAT_I0ABORTF              BIT(5)                                                       /*!< inserted sequence 0 aborted flag */
#define ADC_ESTAT_I0TRGE                BIT(6)                                                       /*!< inserted sequence 0 trigger error */
#define ADC_ESTAT_I1SUSPDF              BIT(8)                                                       /*!< inserted sequence 1 suspended flag */
#define ADC_ESTAT_I1ABORTF              BIT(9)                                                       /*!< inserted sequence 1 aborted flag */
#define ADC_ESTAT_I1TRGE                BIT(10)                                                      /*!< inserted sequence 1 trigger error */
#define ADC_ESTAT_I2SUSPDF              BIT(12)                                                      /*!< inserted sequence 2 suspended flag */
#define ADC_ESTAT_I2ABORTF              BIT(13)                                                      /*!< inserted sequence 2 aborted flag */
#define ADC_ESTAT_I2TRGE                BIT(14)                                                      /*!< inserted sequence 2 trigger error */
#define ADC_ESTAT_I3SUSPDF              BIT(16)                                                      /*!< inserted sequence 3 suspended flag */
#define ADC_ESTAT_I3ABORTF              BIT(17)                                                      /*!< inserted sequence 3 aborted flag */
#define ADC_ESTAT_I3TRGE                BIT(18)                                                      /*!< inserted sequence 3 trigger error */
#define ADC_ESTAT_I4SUSPDF              BIT(20)                                                      /*!< inserted sequence 4 suspended flag */
#define ADC_ESTAT_I4ABORTF              BIT(21)                                                      /*!< inserted sequence 4 aborted flag */
#define ADC_ESTAT_I4TRGE                BIT(22)                                                      /*!< inserted sequence 4 trigger error */
#define ADC_ESTAT_I5ABORTF              BIT(25)                                                      /*!< inserted sequence 5 aborted flag */
#define ADC_ESTAT_I5TRGE                BIT(26)                                                      /*!< inserted sequence 5 trigger error */
#define ADC_ESTAT_WDE                   BIT(31)                                                      /*!< analog watchdog event flag */

