sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* ADC_WDTx(x = 0~3) */
#define ADC_WDT_WDLT                    BITS(0,11)                                                   /*!< low threshold for analog watchdog x */
#define ADC_WDT_WDHT                    BITS(16,27)                                                  /*!< high threshold for analog watchdog x */
#define ADC_WDT_WDEIE                   BIT(31)                                                      /*!< analog watchdog x interrupt enable */

/* ADC_PSMPCFG */
#define ADC_PSMPCFG_PSMP                BITS(0,9)                                                    /*!< ADC channel n presampling time */

/* ADC_CHCFGx(x = 0~61) */
#define ADC_CHCFG_WDMSEL                BITS(0,2)                                                    /*!< analog watchdog mode select */
#define ADC_CHCFG_WDSEL                 BITS(3,4)                                                    /*!< ADC channel x analog watchdog selection */
#define ADC_CHCFG_PSMPEN                BIT(16)                                                      /*!< ADC channel x pre-sample enable */
#define ADC_CHCFG_PSMPVSEL              BIT(17)                                                      /*!< ADC channel x pre-sample voltage select */
#define ADC_CHCFG_DISSMP                BIT(18)                                                      /*!< disable channel x sampling */

/* ADC_WDINTF0 */
#define ADC_WDINTF0_WDIF0               BITS(0,31)                                                   /*!< analog watchdog interrupt flag 0 (for channel n, n = 0~31) */

/* ADC_WDINTF1 */
#define ADC_WDINTF1_WDIF1               BITS(0,29)                                                   /*!< analog watchdog interrupt flag 1 (for channel n, n = 32~61) */

/* ADC_EDDLY */
#define ADC_EDDLY_EDDLY                 BITS(0,15)                                                   /*!< external analog multiplexers decode signals delay time */

/* ADC_CSDLY */
#define ADC_CSDLY_CSDLY                 BITS(0,15)                                                   /*!< the delay from trigger to start conversion */
#define ADC_CSDLY_CSDEN                 BITS(16,22)                                                  /*!< the delay from trigger to start conversion enable */

/* ADC_GAINCFG */
#define ADC_GAINCFG_GAIN                BITS(0,13)                                                   /*!< gain factor */

/* ADC_OFFCFGx(x = 0~3) */
#define ADC_OFFCFG_OFFSET               BITS(0,11)                                                   /*!< offset factor */
#define ADC_OFFCFG_OFFCH                BITS(16,21)                                                  /*!< channel selection for the offset x */
#define ADC_OFFCFG_SIGNEN               BIT(29)                                                      /*!< signed data enable */
#define ADC_OFFCFG_OFFPOS               BIT(30)                                                      /*!< positive offset */
#define ADC_OFFCFG_OFFEN                BIT(31)                                                      /*!< offset x enable */

/* ADC_SYNCCTL */
#define ADC_SYNCCTL_SYNCM               BITS(0,4)                                                    /*!< ADC sync mode */

/* ADC_RCTL */
#define ADC_RCTL_RL                     BITS(0,5)                                                    /*!< routine sequence length */
#define ADC_RCTL_RMODE                  BIT(8)                                                       /*!< routine sequence conversion mode */
#define ADC_RCTL_SWRCST                 BIT(9)                                                       /*!< software start on routine channel */
#define ADC_RCTL_RTRGEIE                BIT(10)                                                      /*!< interrupt enable for RTRGE */
#define ADC_RCTL_RRESTART               BIT(11)                                                      /*!< restart routine sequence when the routine sequence be suspended */
#define ADC_RCTL_RABORT                 BIT(12)                                                      /*!< abort routine sequence current conversion */
#define ADC_RCTL_RDDM                   BIT(13)                                                      /*!< routine sequence DMA disable mode */
#define ADC_RCTL_EORCIE                 BIT(15)                                                      /*!< interrupt enable for EORC */
#define ADC_RCTL_ETMRC                  BITS(16,17)                                                  /*!< external trigger mode for routine sequence */

/* ADC_RSTREAM */
#define ADC_RSTREAM_RSTREAMCNT          BITS(0,15)                                                   /*!< routine sequence stream counter value */
#define ADC_RSTREAM_RSTREAMEN           BIT(16)                                                      /*!< routine sequence stream conversion enable */
#define ADC_RSTREAM_RSTREAMAREN         BIT(17)                                                      /*!< routine sequence stream counter value reload enable */
#define ADC_RSTREAM_RSTREAMIE           BIT(18)                                                      /*!< routine sequence stream interrupt enable */
#define ADC_RSTREAM_RSTREAMF            BIT(31)                                                      /*!< routine sequence stream flag */

/* ADC_RCFGx(x = 0~27) */
#define ADC_RCFG_RSQ                    BITS(0,5)                                                    /*!< the channel number n(n = 0~61) is written to these bits to select a channel as the xth conversion in the routine sequence */
#define ADC_RCFG_RCHIE                  BIT(8)                                                       /*!< routine sequence channel x interrupt enables for RCHIF or EORCHC */
#define ADC_RCFG_RCHDMAEN               BIT(9)                                                       /*!< routine sequence channel x DMA request enable */
#define ADC_RCFG_RSMP                   BITS(16,25)                                                  /*!< routine sequence channel x sample time */

