sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* ADC_RCHINF */
#define ADC_RCHINF_RCHIF                BITS(0,27)                                                   /*!< routine sequence channel conversion end interrupt flag */

/* ADC_RCHDATAx(x = 0~27) */
#define ADC_RCHDATA_RCHDATA             BITS(0,15)                                                   /*!< routine sequence channel x conversion data */
#define ADC_RCHDATA_RCH                 BITS(16,21)                                                  /*!< routine sequence channel x */
#define ADC_RCHDATA_RCHOVWF             BIT(24)                                                      /*!< routine sequence channel x conversion data overwritten flag */
#define ADC_RCHDATA_RCHAVLB             BIT(25)                                                      /*!< routine sequence channel x conversion data available */

/* ADC_RDATA */
#define ADC_RDATA_RDATA                 BITS(0,15)                                                   /*!< routine sequence conversion result */
#define ADC_RDATA_RSQCH                 BITS(16,21)                                                  /*!< routine sequence channel */
#define ADC_RDATA_ROVWF                 BIT(24)                                                      /*!< routine sequence conversion data overwritten flag */
#define ADC_RDATA_RAVLB                 BIT(25)                                                      /*!< routine sequence conversion data available */
#define ADC_RDATA_RDMAEN                BIT(31)                                                      /*!< routine sequence DMA request enable */

/* ADC_IxCTL(x = 0~5) */
#define ADC_ICTL_IL                     BITS(0,1)                                                    /*!< inserted sequence length */
#define ADC_ICTL_SWICST                 BIT(9)                                                       /*!< software start on inserted channel */
#define ADC_ICTL_ITRGEIE                BIT(10)                                                      /*!< interrupt enable for ITRGE */
#define ADC_ICTL_IRESTART               BIT(11)                                                      /*!< restart inserted sequence m when inserted sequence m be suspended */
#define ADC_ICTL_IABORT                 BIT(12)                                                      /*!< abort inserted sequence m current conversion */
#define ADC_ICTL_IDDM                   BIT(13)                                                      /*!< inserted sequence DMA disable mode */
#define ADC_ICTL_IEOCIE                 BIT(15)                                                      /*!< interrupt enable for EOIC */
#define ADC_ICTL_ETMIC                  BITS(16,17)                                                  /*!< external trigger mode for inserted sequence */

/* ADC_IxSTREAM(x = 0~5) */
#define ADC_ISTREAM_ISTREAMCNT          BITS(0,15)                                                   /*!< inserted sequence stream counter value */
#define ADC_ISTREAM_ISTREAMEN           BIT(16)                                                      /*!< inserted sequence stream conversion enable */
#define ADC_ISTREAM_ISTREAMAREN         BIT(17)                                                      /*!< inserted sequence stream counter value reload enable */
#define ADC_ISTREAM_ISTREAMIE           BIT(18)                                                      /*!< inserted sequence stream interrupt enable */
#define ADC_ISTREAM_ISTREAMF            BIT(31)                                                      /*!< inserted sequence stream flag */

/* ADC_IxCFGy(x = 0~5, y = 0~3) */
#define ADC_ICFG_ISQ                    BITS(0,5)                                                    /*!< the channel number y(y = 0~3) is written to these bits to select a channel as the xth conversion in the inserted sequence */
#define ADC_ICFG_ICHIE                  BIT(8)                                                       /*!< inserted sequence x channel interrupt enable for ICHIF or EOImCHC */
#define ADC_ICFG_ICHDMAEN               BIT(9)                                                       /*!< inserted sequence x channel y DMA request enable */
#define ADC_ICFG_ISMP                   BITS(16,25)                                                  /*!< inserted sequence x channel y sample time */

/* ADC_IxCHINTF(x = 0~5) */
#define ADC_ICHINTF_ICHIF               BITS(0,3)                                                    /*!< inserted sequence x end of channel conversion flag */

/* ADC_IxCHDATAy(x = 0~5) */
#define ADC_ICHDATA_ICHDATA             BITS(0,15)                                                   /*!< inserted sequence x channel y conversion data */
#define ADC_ICHDATA_ICH                 BITS(16,21)                                                  /*!< inserted sequence x channel y */
#define ADC_ICHDATA_ICHOVWF             BIT(24)                                                      /*!< inserted sequence x channel y conversion data overwritten flag */
#define ADC_ICHDATA_ICHAVLB             BIT(25)                                                      /*!< Inserted sequence x channel y conversion data available */

/* ADC_IxDATA(x = 0~5) */
#define ADC_IDATA_IDATA                 BITS(0,15)                                                   /*!< inserted sequence x conversion data */
#define ADC_IDATA_ISQCH                 BITS(16,21)                                                  /*!< inserted sequence x channel */
#define ADC_IDATA_IOVWF                 BIT(24)                                                      /*!< inserted sequence x conversion data overwritten flag */
#define ADC_IDATA_IAVLB                 BIT(25)                                                      /*!< inserted sequence x conversion data available */
#define ADC_IDATA_IDMAEN                BIT(31)                                                      /*!< inserted sequence x DMA request enable */

/* ADC_STSAMPT */
#define ADC_STSAMPT_SSPT                BITS(0,9)                                                    /*!< sampling time for supply selftest step */
#define ADC_STSAMPT_CSPT                BITS(16,25)                                                  /*!< sampling time for capacitive selftest step */

/* ADC_STINTEN */
#define ADC_STINTEN_FMUSSTEIE           BIT(8)                                                       /*!< interrupt enable for supply self test error SSTxE to FMU */
#define ADC_STINTEN_FMUCSTEIE           BIT(9)                                                       /*!< interrupt enable for capacitive self test error CSTE to FMU */
#define ADC_STINTEN_FMUWDTEIE           BIT(10)                                                      /*!< interrupt enable for watchdog timer error WDTE to FMU */
#define ADC_STINTEN_FMUSTODEIE          BIT(11)                                                      /*!< interrupt enable for self test order error STODE to FMU */
#define ADC_STINTEN_STODEIE             BIT(16)                                                      /*!< interrupt enable for STODE */
#define ADC_STINTEN_WDTEIE              BIT(17)                                                      /*!< interrupt enable for WDTE */
#define ADC_STINTEN_CSTEIE              BIT(19)                                                      /*!< interrupt enable for CSTE */
#define ADC_STINTEN_SST0EIE             BIT(20)                                                      /*!< interrupt enable for SST0E */
#define ADC_STINTEN_SST1EIE             BIT(21)                                                      /*!< interrupt enable for SST1E */
#define ADC_STINTEN_SST2EIE             BIT(22)                                                      /*!< interrupt enable for SST2E */
#define ADC_STINTEN_STEOVWIE            BIT(23)                                                      /*!< interrupt enable for STEOVW */
#define ADC_STINTEN_EOSSTCIE            BIT(24)                                                      /*!< interrupt enable for EOSSTC */
#define ADC_STINTEN_EOCSTCIE            BIT(25)                                                      /*!< interrupt enable for EOCSTC */
#define ADC_STINTEN_EOSTCIE             BIT(26)                                                      /*!< interrupt enable for EOSTC */

/* ADC_STCFG */
#define ADC_STCFG_STSSEL                BITS(0,2)                                                    /*!< capacitive and supply steps select in one shot mode */
#define ADC_STCFG_STMSEL                BITS(8,9)                                                    /*!< self test mode select */
#define ADC_STCFG_STEXER                BITS(16,23)                                                  /*!< self test execution rate */
#define ADC_STCFG_STWDT                 BITS(24,26)                                                  /*!< self test watchdog timer */
#define ADC_STCFG_STEN                  BIT(31)                                                      /*!< self test enable */

/* ADC_STSTAT */
#define ADC_STSTAT_CSTESTP              BITS(0,2)                                                    /*!< error step of capacitive self test */
#define ADC_STSTAT_STODE                BIT(16)                                                      /*!< self test step order error */
#define ADC_STSTAT_WDTE                 BIT(17)                                                      /*!< watchdog timer error */
#define ADC_STSTAT_CSTE                 BIT(19)                                                      /*!< capacitive self test error */
#define ADC_STSTAT_SST0E                BIT(20)                                                      /*!< supply self test step 0 error */
#define ADC_STSTAT_SST1E                BIT(21)                                                      /*!< supply self test step 1 error */
#define ADC_STSTAT_SST2E                BIT(22)                                                      /*!< supply self test step 2 error */
#define ADC_STSTAT_STEOVW               BIT(23)                                                      /*!< self test error overwrite */
#define ADC_STSTAT_EOSSTC               BIT(24)                                                      /*!< end of all supply self test steps conversion */
#define ADC_STSTAT_EOCSTC               BIT(25)                                                      /*!< end of all capacitive self test steps conversion */
#define ADC_STSTAT_EOSTC                BIT(26)                                                      /*!< end of self test conversion */

/* ADC_STEDATA0 */
#define ADC_STEDATA0_SST1EDATA          BITS(0,11)                                                   /*!< error data of supply self test step 1 conversion data */
#define ADC_STEDATA0_SST2EDATA          BITS(16,27)                                                  /*!< error data of supply self test step 2 conversion data */

