sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* ADC_STEDATA1 */
#define ADC_STEDATA1_CSTEDATA           BITS(0,11)                                                   /*!< error data of capacitive self test step conversion data */
#define ADC_STEDATA1_SST0EDATA          BITS(16,27)                                                  /*!< error data of supply self test step 0 conversion data */

/* ADC_STDATA */
#define ADC_STDATA_STDATA               BITS(0, 11)                                                  /*!< self test conversion data */
#define ADC_STDATA_STSTP                BITS(16, 20)                                                 /*!< self test step */
#define ADC_STDATA_STOVWF               BIT(24)                                                      /*!< self test conversion data overwritten flag */
#define ADC_STDATA_STAVLB               BIT(25)                                                      /*!< self test conversion data available */

/* ADC_SSTWDCFGx(x = 0~2) */
#define ADC_SSTWDCFG_SSTWDLT            BITS(0,11)                                                   /*!< supply self test step 1/2 watchdog low threshold value */
#define ADC_SSTWDCFG_SSTWDHT            BITS(16,27)                                                  /*!< supply self test step 0/1 watchdog high threshold value */
#define ADC_SSTWDCFG_SSTWDTEN           BIT(30)                                                      /*!< self test watchdog timer enable(only ADC_SSTWDCFG0) */
#define ADC_SSTWDCFG_SSTWDEN            BIT(31)                                                      /*!< supply self test step 0/1/2 watchdog enable */

/* ADC_CSTWDCFGx(x = 0~3) */
#define ADC_CSTWDCFG_CSTWDHT0           BITS(0,7)                                                    /*!< capacitive self test step n(n=x*2) watchdog threshold value */
#define ADC_CSTWDCFG_CSTWDEN0           BIT(15)                                                      /*!< capacitive self test step n(n=x*2) watchdog threshold value */
#define ADC_CSTWDCFG_CSTWDHT1           BITS(16,23)                                                  /*!< capacitive self test step n+1(n=x*2) watchdog threshold value */
#define ADC_CSTWDCFG_CSTWDTEN           BIT(30)                                                      /*!< capacitive self test watchdog timer enable(only for ADC_CSTWDCFG3) */
#define ADC_CSTWDCFG_CSTWDEN1           BIT(31)                                                      /*!< capacitive self test step n+1(n=x*2) watchdog threshold value */

/* ADC_DTALTCFG */
#define ADC_DTALTCFG_LTLT               BITS(0,7)                                                    /*!< DAC - ADC looptest low threshold value */
#define ADC_DTALTCFG_DAC0SEL            BIT(14)                                                      /*!< select DAC0_OUT0 as ADC input in DAC to ADC loop test mode */
#define ADC_DTALTCFG_DAC1SEL            BIT(15)                                                      /*!< select DAC1_OUT0 as ADC input in DAC to ADC loop test mode */
#define ADC_DTALTCFG_LTHT               BITS(16,23)                                                  /*!< DAC - ADC loopt est high threshold value */
#define ADC_DTALTCFG_LTE                BIT(28)                                                      /*!< DAC - ADC loopt est error */
#define ADC_DTALTCFG_LTEIE              BIT(29)                                                      /*!< interrupt enable enable for LTE to FMU */
#define ADC_DTALTCFG_LTEN               BIT(30)                                                      /*!< DAC - ADC loop test enable */

/* constants definitions */
/* ADC sequence channel length definitions */
#define RCTL_RL(regval)                                  (BITS(0,4) & ((uint32_t)(regval) << 0))     /*!< ADC routine sequence channel length */
#define ICTL_IL(regval)                                  (BITS(0,1) & ((uint32_t)(regval) << 0))     /*!< ADC inserted sequence channel length */

/* ADC calibration times */
#define CTL_CALNUM(regval)                               (BITS(21,23) & ((uint32_t)(regval) << 21))  /*!< write value to ADC_CTL_CALNUM bit field */
#define ADC_CALIBRATION_NUM1                             CTL_CALNUM(0)                               /*!< calibration 1 time */
#define ADC_CALIBRATION_NUM3                             CTL_CALNUM(1)                               /*!< calibration 3 times */
#define ADC_CALIBRATION_NUM7                             CTL_CALNUM(2)                               /*!< calibration 7 times */
#define ADC_CALIBRATION_NUM15                            CTL_CALNUM(3)                               /*!< calibration 15 times */
#define ADC_CALIBRATION_NUM31                            CTL_CALNUM(4)                               /*!< calibration 31 times */

/* ADC average conversion number definitions */
#define CTL_AVGSEL(regval)                               (BITS(3,5) & ((uint32_t)(regval) << 3))     /*!< write value to ADC_CTL_AVRGSEL bit field */
#define ADC_AVERAGE_2_CONVERSIONS                        CTL_AVGSEL(0)                               /*!< 2 conversion data average */
#define ADC_AVERAGE_4_CONVERSIONS                        CTL_AVGSEL(1)                               /*!< 4 conversion data average */
#define ADC_AVERAGE_8_CONVERSIONS                        CTL_AVGSEL(2)                               /*!< 8 conversion data average */
#define ADC_AVERAGE_16_CONVERSIONS                       CTL_AVGSEL(3)                               /*!< 16 conversion data average */
#define ADC_AVERAGE_32_CONVERSIONS                       CTL_AVGSEL(4)                               /*!< 32 conversion data average */
#define ADC_AVERAGE_64_CONVERSIONS                       CTL_AVGSEL(5)                               /*!< 64 conversion data average */
#define ADC_AVERAGE_128_CONVERSIONS                      CTL_AVGSEL(6)                               /*!< 128 conversion data average */
#define ADC_AVERAGE_256_CONVERSIONS                      CTL_AVGSEL(7)                               /*!< 256 conversion data average */

/* ADC resolution */
#define CTL_DRES(regval)                                 (BITS(13,14) & ((uint32_t)(regval) << 13))  /*!< write value to ADC_CTL_DRES bit field */
#define ADC_RESOLUTION_12B                               CTL_DRES(0)                                 /*!< 12-bit ADC resolution */
#define ADC_RESOLUTION_10B                               CTL_DRES(1)                                 /*!< 10-bit ADC resolution */
#define ADC_RESOLUTION_8B                                CTL_DRES(2)                                 /*!< 8-bit ADC resolution */
#define ADC_RESOLUTION_6B                                CTL_DRES(3)                                 /*!< 6-bit ADC resolution */

/* ADC idle state clock */
#define ADC_CLOCK_IDLE_STATE_ON                          ((uint32_t)0x00000000U)                     /*!< clock on */
#define ADC_CLOCK_IDLE_STATE_OFF                         ADC_CTL_CKAUTO                              /*!< clock automatic off when the ADC in idle state */

