sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT                              ((uint32_t)0x00000000U)                     /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT                               ADC_CTL_DAL                                 /*!< MSB alignment */

/* ADC internal channel definitions */
#define ADC_CHANNEL_INTERNAL_VREFINT                     ADC_CTL_INREFEN                             /*!< internal reference voltage vrefint channel */
#define ADC_CHANNEL_INTERNAL_HP_TEMPSENSOR               ADC_CTL_HPTSVEN                             /*!< high-precision temperature sensor channel */

/* ADC calibration mode */
#define ADC_CALIBRATION_OFFSET_MISMATCH                  ((uint32_t)0x00000000U)                     /*!< ADC calibration offset and mismatch mode */
#define ADC_CALIBRATION_OFFSET                           ADC_CTL_CALMOD                              /*!< ADC calibration offset mode */

/* ADC offset configure */
#define ADC_NEGATIVE_OFFSET                              ((uint32_t)0x00000000U)                     /*!< negative offset */
#define ADC_POSITIVE_OFFSET                              ADC_OFFCFG_OFFPOS                           /*!< positive offset */

/* ADC synchronization mode */
#define SYNCCTL_SYNCM(regval)                            (BITS(0,4) & ((uint32_t)(regval) << 0))     /*!< write value to ADC_SYNCCTL_SYNCM bit field */
#define ADC_MODE_FREE                                    SYNCCTL_SYNCM(0)                            /*!< all the ADCs work independently */
#define ADC_DUAL_ROUTINE_PARALLEL_INSERTED_PARALLEL      SYNCCTL_SYNCM(1)                            /*!< ADC0 and ADC1 work in combined routine parallel + inserted parallel mode */
#define ADC_DUAL_ROUTINE_PARALLEL_ROTATION               SYNCCTL_SYNCM(2)                            /*!< ADC0 and ADC1 work in combined routine parallel + trigger rotation mode */
#define ADC_DUAL_INSERTED_PARALLEL                       SYNCCTL_SYNCM(5)                            /*!< ADC0 and ADC1 work in inserted parallel mode */
#define ADC_DUAL_ROUTINE_PARALLEL                        SYNCCTL_SYNCM(6)                            /*!< ADC0 and ADC1 work in routine parallel mode */
#define ADC_DUAL_FOLLOWUP                                SYNCCTL_SYNCM(7)                            /*!< ADC0 and ADC1 work in follow-up mode */
#define ADC_DUAL_TRRIGGER_ROTATION                       SYNCCTL_SYNCM(9)                            /*!< ADC0 and ADC1 work in trigger rotation mode */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define ADC_ALL_ROUTINE_PARALLEL_INSERTED_PARALLEL       SYNCCTL_SYNCM(17)                           /*!< ADC0, ADC1 and ADC2 work in combined routine parallel + inserted parallel mode */
#define ADC_ALL_ROUTINE_PARALLEL_ROTATION                SYNCCTL_SYNCM(18)                           /*!< ADC0, ADC1 and ADC2 work in combined routine parallel + trigger rotation mode */
#define ADC_ALL_INSERTED_PARALLEL                        SYNCCTL_SYNCM(21)                           /*!< ADC0, ADC1 and ADC2 work in inserted parallel mode */
#define ADC_ALL_ROUTINE_PARALLEL                         SYNCCTL_SYNCM(22)                           /*!< ADC0, ADC1 and ADC2 work in routine parallel mode */
#define ADC_ALL_FOLLOWUP                                 SYNCCTL_SYNCM(23)                           /*!< ADC0, ADC1 and ADC2 work in follow-up mode */
#define ADC_ALL_TRRIGGER_ROTATION                        SYNCCTL_SYNCM(25)                           /*!< ADC0, ADC1 and ADC2 work in trigger rotation mode */
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* ADC channel analog watchdog selection */
#define ADC_ANALOG_WATCHDOG0                             ((uint32_t)0x00000000U)                     /*!< analog watchdog 0 */
#define ADC_ANALOG_WATCHDOG1                             ((uint32_t)0x00000001U)                     /*!< analog watchdog 1 */
#define ADC_ANALOG_WATCHDOG2                             ((uint32_t)0x00000002U)                     /*!< analog watchdog 2 */
#define ADC_ANALOG_WATCHDOG3                             ((uint32_t)0x00000003U)                     /*!< analog watchdog 3 */

/* ADC analog watchdog mode selection */
#define CHCFG_WDMSEL(regval)                             (BITS(0,2) & ((uint32_t)(regval) << 0))     /*!< write value to ADC_CHCFG_WDMSEL bit field */
#define ADC_ANALOG_WATCHDOG_DISABLE                      CHCFG_WDMSEL(0)                             /*!< analog watchdog disable */
#define ADC_RESULT_WDLT                                  CHCFG_WDMSEL(1)                             /*!< result <= WDLT */
#define ADC_WDLT_RESULT_WDHT                             CHCFG_WDMSEL(2)                             /*!< WDLT < result <= WDHT */
#define ADC_WDHT_RESULT                                  CHCFG_WDMSEL(3)                             /*!< result > WDHT */
#define ADC_WDLT_RESULT                                  CHCFG_WDMSEL(4)                             /*!< result > WDLT */
#define ADC_WDHT_RESULT_WDLT                             CHCFG_WDMSEL(5)                             /*!< result > WDHT or result <= WDLT */
#define ADC_RESULT_WDHT                                  CHCFG_WDMSEL(6)                             /*!< result <= WDHT */

/* ADC pre-sample voltage selection */
#define ADC_PSMPVSEL_VREFN                               ((uint32_t)0x00000000U)                     /*!< pre-sample voltage select VREFN */
#define ADC_PSMPVSEL_VREFP                               ADC_CHCFG_PSMPVSEL                          /*!< pre-sample voltage select VREFP */

/* ADC pre-sample followed */
#define ADC_NO_CONVERSION_AFTER_PRESAMPLE                ((uint32_t)0x00000000U)                     /*!< channel sampling is not disabled, no conversion for the presampled value after presampling */
#define ADC_PRESAMPLE_FOLLOW_CONVERSION                  ADC_CHCFG_DISSMP                            /*!< channel sampling is disabled, conversion for the presampled value after presampling */

/* ADC sequence definitions */
#define ADC_INSERTED_SEQUENCE_NONE                       ((uint32_t)0x000000FFU)                     /*!< none inserted sequence */
#define ADC_ROUTINE_SEQUENCE                             ((uint32_t)0x00000010U)                     /*!< routine sequence */
#define ADC_INSERTED_SEQUENCE0                           ((uint32_t)0x00000000U)                     /*!< inserted sequence 0 */
#define ADC_INSERTED_SEQUENCE1                           ((uint32_t)0x00000001U)                     /*!< inserted sequence 1 */
#define ADC_INSERTED_SEQUENCE2                           ((uint32_t)0x00000002U)                     /*!< inserted sequence 2 */
#define ADC_INSERTED_SEQUENCE3                           ((uint32_t)0x00000003U)                     /*!< inserted sequence 3 */
#define ADC_INSERTED_SEQUENCE4                           ((uint32_t)0x00000004U)                     /*!< inserted sequence 4 */
#define ADC_INSERTED_SEQUENCE5                           ((uint32_t)0x00000005U)                     /*!< inserted sequence 5 */

/* ADC sequence conversion mode */
#define ADC_ONE_SHOT_MODE                                ((uint32_t)0x00000000U)                     /*!< one-shot mode */
#define ADC_CONTINUOUS_MODE                              ADC_RCTL_RMODE                              /*!< continuous mode (only for routine sequence) */

