sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* ADC recovery sequence way */
#define ADC_RESUME_SEQUENCE                              ((uint32_t)0x00000000U)                     /*!< resume sequence conversion */
#define ADC_RESTART_SEQUENCE                             ADC_RCTL_RRESTART                           /*!< restart sequence conversion */

/* abort sequences current conversion */
#define ADC_SEQUENCE_PROCEED                             ((uint32_t)0x00000000U)                     /*!< adc sequence conversion proceeds */
#define ADC_SEQUENCE_ABORT                               ADC_RCTL_RABORT                             /*!< adc sequence conversion aborted */

/* ADC external trigger definitions */
#define RISCTL_ETMRC(regval)                             (BITS(16,17) & ((uint32_t)(regval) << 16)) /*!< write value to ADC_RCTL/ICTL_ETMRC bit field */
#define ADC_EXTERNAL_TRIGGER_DISABLE                     RISCTL_ETMRC(0)                            /*!< external trigger disable */
#define ADC_EXTERNAL_TRIGGER_RISING_EDGE                 RISCTL_ETMRC(1)                            /*!< rising edge of external trigger */
#define ADC_EXTERNAL_TRIGGER_FALLING_EDGE                RISCTL_ETMRC(2)                            /*!< falling edge of external trigger */
#define ADC_EXTERNAL_TRIGGER_RISING_FALLING_EDGE         RISCTL_ETMRC(3)                            /*!< rising and falling edge of external trigger */

/* delay time from trigger to start conversion enable */
#define CSDLY_CSDEN(regval)                              (BITS(16,22) & ((uint32_t)(regval) << 16))  /*!< write value to ADC_CSDLY_CSDEN bit field */
#define ADC_ALL_TRIGGER_DELAY_DISABLE                    CSDLY_CSDEN(0)                              /*!< all sequences trigger delay disable */
#define ADC_ROUTINE_SEQUENCE_TRIGGER_DELAY               CSDLY_CSDEN(1)                              /*!< routine sequence trigger delay enable */
#define ADC_INSERTED_SEQUENCE0_TRIGGER_DELAY             CSDLY_CSDEN(2)                              /*!< inserted sequence 0 trigger delay enable */
#define ADC_INSERTED_SEQUENCE1_TRIGGER_DELAY             CSDLY_CSDEN(4)                              /*!< inserted sequence 1 trigger delay enable */
#define ADC_INSERTED_SEQUENCE2_TRIGGER_DELAY             CSDLY_CSDEN(8)                              /*!< inserted sequence 2 trigger delay enable */
#define ADC_INSERTED_SEQUENCE3_TRIGGER_DELAY             CSDLY_CSDEN(16)                             /*!< inserted sequence 3 trigger delay enable */
#define ADC_INSERTED_SEQUENCE4_TRIGGER_DELAY             CSDLY_CSDEN(32)                             /*!< inserted sequence 4 trigger delay enable */
#define ADC_INSERTED_SEQUENCE5_TRIGGER_DELAY             CSDLY_CSDEN(64)                             /*!< inserted sequence 5 trigger delay enable */

/* ADC flag definitions */
#define ADC_FLAG_ACTST                                   ADC_STAT_ACTST                              /*!< self test ongoing flag */
#define ADC_FLAG_EORC                                    ADC_STAT_EORC                               /*!< end of routine sequence conversion flag */
#define ADC_FLAG_EOI0C                                   ADC_STAT_EOI0C                              /*!< end of inserted sequence 0 conversion flag */
#define ADC_FLAG_EOI1C                                   ADC_STAT_EOI1C                              /*!< end of inserted sequence 1 conversion flag */
#define ADC_FLAG_EOI2C                                   ADC_STAT_EOI2C                              /*!< end of inserted sequence 2 conversion flag */
#define ADC_FLAG_EOI3C                                   ADC_STAT_EOI3C                              /*!< end of inserted sequence 3 conversion flag */
#define ADC_FLAG_EOI4C                                   ADC_STAT_EOI4C                              /*!< end of inserted sequence 4 conversion flag */
#define ADC_FLAG_EOI5C                                   ADC_STAT_EOI5C                              /*!< end of inserted sequence 5 conversion flag */
#define ADC_FLAG_EORCHC                                  ADC_STAT_EORCHC                             /*!< end of routine sequence channel conversion flag */
#define ADC_FLAG_EOI0CHC                                 ADC_STAT_EOI0CHC                            /*!< end of inserted sequence 0 channel conversion flag */
#define ADC_FLAG_EOI1CHC                                 ADC_STAT_EOI1CHC                            /*!< end of inserted sequence 1 channel conversion flag */
#define ADC_FLAG_EOI2CHC                                 ADC_STAT_EOI2CHC                            /*!< end of inserted sequence 2 channel conversion flag */
#define ADC_FLAG_EOI3CHC                                 ADC_STAT_EOI3CHC                            /*!< end of inserted sequence 3 channel conversion flag */
#define ADC_FLAG_EOI4CHC                                 ADC_STAT_EOI4CHC                            /*!< end of inserted sequence 4 channel conversion flag */
#define ADC_FLAG_EOI5CHC                                 ADC_STAT_EOI5CHC                            /*!< end of inserted sequence 5 channel conversion flag */

/* ADC error flag definitions */
#define ADC_FLAG_RSUSPDF                                 ADC_ESTAT_RSUSPDF                           /*!< routine sequence suspended flag */
#define ADC_FLAG_RABORTF                                 ADC_ESTAT_RABORTF                           /*!< routine sequence aborted flag */
#define ADC_FLAG_RTRGE                                   ADC_ESTAT_RTRGE                             /*!< routine sequence trigger error flag */
#define ADC_FLAG_I0SUSPDF                                ADC_ESTAT_I0SUSPDF                          /*!< inserted sequence 0 suspended flag */
#define ADC_FLAG_I0ABORTF                                ADC_ESTAT_I0ABORTF                          /*!< inserted sequence 0 aborted flag */
#define ADC_FLAG_I0TRGE                                  ADC_ESTAT_I0TRGE                            /*!< inserted sequence 0 trigger error flag */
#define ADC_FLAG_I1SUSPDF                                ADC_ESTAT_I1SUSPDF                          /*!< inserted sequence 1 suspended flag */
#define ADC_FLAG_I1ABORTF                                ADC_ESTAT_I1ABORTF                          /*!< inserted sequence 1 aborted flag */
#define ADC_FLAG_I1TRGE                                  ADC_ESTAT_I1TRGE                            /*!< inserted sequence 1 trigger error flag */
#define ADC_FLAG_I2SUSPDF                                ADC_ESTAT_I2SUSPDF                          /*!< inserted sequence 2 suspended flag */
#define ADC_FLAG_I2ABORTF                                ADC_ESTAT_I2ABORTF                          /*!< inserted sequence 2 aborted flag */
#define ADC_FLAG_I2TRGE                                  ADC_ESTAT_I2TRGE                            /*!< inserted sequence 2 trigger error flag */
#define ADC_FLAG_I3SUSPDF                                ADC_ESTAT_I3SUSPDF                          /*!< inserted sequence 3 suspended flag */
#define ADC_FLAG_I3ABORTF                                ADC_ESTAT_I3ABORTF                          /*!< inserted sequence 3 aborted flag */
#define ADC_FLAG_I3TRGE                                  ADC_ESTAT_I3TRGE                            /*!< inserted sequence 3 trigger error flag */
#define ADC_FLAG_I4SUSPDF                                ADC_ESTAT_I4SUSPDF                          /*!< inserted sequence 4 suspended flag */
#define ADC_FLAG_I4ABORTF                                ADC_ESTAT_I4ABORTF                          /*!< inserted sequence 4 aborted flag */
#define ADC_FLAG_I4TRGE                                  ADC_ESTAT_I4TRGE                            /*!< inserted sequence 4 trigger error flag */
#define ADC_FLAG_I5ABORTF                                ADC_ESTAT_I5ABORTF                          /*!< inserted sequence 5 aborted flag */
#define ADC_FLAG_I5TRGE                                  ADC_ESTAT_I5TRGE                            /*!< inserted sequence 5 trigger error flag */
#define ADC_FLAG_WDE                                     ADC_ESTAT_WDE                               /*!< analog watchdog flag */
#define ADC_FLAG_LTE                                     ADC_DTALTCFG_LTE                            /*!< DAC - ADC loop test error flag */

/* ADC interrupt flag definitions */
#define ADC_INT_FLAG_EORC                                ((uint32_t)0x00000000U)                     /*!< end of routine sequence conversion interrupt flag */
#define ADC_INT_FLAG_EOI0C                               ((uint32_t)0x00000001U)                     /*!< end of inserted sequence 0 conversion interrupt flag */
#define ADC_INT_FLAG_EOI1C                               ((uint32_t)0x00000002U)                     /*!< end of inserted sequence 1 conversion interrupt flag */
#define ADC_INT_FLAG_EOI2C                               ((uint32_t)0x00000003U)                     /*!< end of inserted sequence 2 conversion interrupt flag */
#define ADC_INT_FLAG_EOI3C                               ((uint32_t)0x00000004U)                     /*!< end of inserted sequence 3 conversion interrupt flag */
#define ADC_INT_FLAG_EOI4C                               ((uint32_t)0x00000005U)                     /*!< end of inserted sequence 4 conversion interrupt flag */
#define ADC_INT_FLAG_EOI5C                               ((uint32_t)0x00000006U)                     /*!< end of inserted sequence 5 conversion interrupt flag */
#define ADC_INT_FLAG_EORCHC                              ((uint32_t)0x00000007U)                     /*!< end of routine sequence channel conversion interrupt flag */
#define ADC_INT_FLAG_EOI0CHC                             ((uint32_t)0x00000008U)                     /*!< end of inserted sequence 0 channel conversion interrupt flag */
#define ADC_INT_FLAG_EOI1CHC                             ((uint32_t)0x00000009U)                     /*!< end of inserted sequence 1 channel conversion interrupt flag */
#define ADC_INT_FLAG_EOI2CHC                             ((uint32_t)0x0000000AU)                     /*!< end of inserted sequence 2 channel conversion interrupt flag */
#define ADC_INT_FLAG_EOI3CHC                             ((uint32_t)0x0000000BU)                     /*!< end of inserted sequence 3 channel conversion interrupt flag */
#define ADC_INT_FLAG_EOI4CHC                             ((uint32_t)0x0000000CU)                     /*!< end of inserted sequence 4 channel conversion interrupt flag */
#define ADC_INT_FLAG_EOI5CHC                             ((uint32_t)0x0000000DU)                     /*!< end of inserted sequence 5 channel conversion interrupt flag */
#define ADC_INT_FLAG_RTRGE                               ((uint32_t)0x0000000EU)                     /*!< routine sequence trigger error interrupt flag */
#define ADC_INT_FLAG_I0TRGE                              ((uint32_t)0x0000000FU)                     /*!< inserted sequence 0 trigger error interrupt flag */
#define ADC_INT_FLAG_I1TRGE                              ((uint32_t)0x00000010U)                     /*!< inserted sequence 1 trigger error interrupt flag */
#define ADC_INT_FLAG_I2TRGE                              ((uint32_t)0x00000011U)                     /*!< inserted sequence 2 trigger error interrupt flag */
#define ADC_INT_FLAG_I3TRGE                              ((uint32_t)0x00000012U)                     /*!< inserted sequence 3 trigger error interrupt flag */
#define ADC_INT_FLAG_I4TRGE                              ((uint32_t)0x00000013U)                     /*!< inserted sequence 4 trigger error interrupt flag */
#define ADC_INT_FLAG_I5TRGE                              ((uint32_t)0x00000014U)                     /*!< inserted sequence 5 trigger error interrupt flag */
#define ADC_INT_FLAG_LTE                                 ((uint32_t)0x00000015U)                     /*!< DAC - ADC loop test error interrupt flag */

/* ADC state definitions */
#define STAT_ADCSTAT(regval)                             (BITS(0,2) & ((uint32_t)(regval) << 0))     /*!< write value to ADC_STAT_ADCSTAT bit field */
#define ADC_STATE_IDLE                                   STAT_ADCSTAT(0)                             /*!< ADC not working */
#define ADC_STATE_WAIT                                   STAT_ADCSTAT(1)                             /*!< ADC in conversion start delay state */
#define ADC_STATE_PSAMP                                  STAT_ADCSTAT(2)                             /*!< ADC in presampling state */
#define ADC_STATE_EDDLY                                  STAT_ADCSTAT(3)                             /*!< ADC in external decode signals delay state */
#define ADC_STATE_SAMP                                   STAT_ADCSTAT(4)                             /*!< ADC in sampling state */
#define ADC_STATE_CONV                                   STAT_ADCSTAT(5)                             /*!< ADC in converting state */

