sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* ADC interrupt definitions */
#define ADC_INT_RTRGEIE                                  ((uint32_t)0x00000000U)                     /*!< routine sequence trigger error interrupt */
#define ADC_INT_EORCIE                                   ((uint32_t)0x00000001U)                     /*!< routine sequence end conversion interrupt */
#define ADC_INT_RSTREAMIE                                ((uint32_t)0x00000002U)                     /*!< routine sequence stream mode interrupt */
#define ADC_INT_ITRGEIE                                  ((uint32_t)0x00000003U)                     /*!< inserted sequence trigger error interrupt */
#define ADC_INT_IEOCIE                                   ((uint32_t)0x00000004U)                     /*!< inserted sequence end conversion interrupt */
#define ADC_INT_ISTREAMIE                                ((uint32_t)0x00000005U)                     /*!< inserted sequence stream mode interrupt */
#define ADC_INT_ANALOG_WATCHDOG0                         ((uint32_t)0x00000006U)                     /*!< analog watchdog 0 interrupt */
#define ADC_INT_ANALOG_WATCHDOG1                         ((uint32_t)0x00000007U)                     /*!< analog watchdog 1 interrupt */
#define ADC_INT_ANALOG_WATCHDOG2                         ((uint32_t)0x00000008U)                     /*!< analog watchdog 2 interrupt */
#define ADC_INT_ANALOG_WATCHDOG3                         ((uint32_t)0x00000009U)                     /*!< analog watchdog 3 interrupt */
#define ADC_INT_LOOPTEST                                 ((uint32_t)0x0000000AU)                     /*!< DAC to ADC loop test error interrupt */
#define ADC_INT_OVERWRITE                                ((uint32_t)0x0000000BU)                     /*!< sequence overwrite interrupt */
#define ADC_INT_CHOVERWRITE                              ((uint32_t)0x0000000CU)                     /*!< channel overwrite interrupt interrupt */

/* ADC self test step definitions */
#define STCFG_STSSEL(regval)                             (BITS(0,2) & ((uint32_t)(regval) << 0))     /*!< write value to ADC_STCFG_STSSEL bit field */
#define ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP0             STCFG_STSSEL(0)                             /*!< for supply or capacitive self test step 0 */
#define ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP1             STCFG_STSSEL(1)                             /*!< for supply or capacitive self test step 1 */
#define ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP2             STCFG_STSSEL(2)                             /*!< for supply or capacitive self test step 2 */
#define ADC_SELFTEST_CAPACITIVE_STEP3                    STCFG_STSSEL(3)                             /*!< for capacitive self test step 3 */
#define ADC_SELFTEST_CAPACITIVE_STEP4                    STCFG_STSSEL(4)                             /*!< for capacitive self test step 4 */
#define ADC_SELFTEST_CAPACITIVE_STEP5                    STCFG_STSSEL(5)                             /*!< for capacitive self test step 5 */
#define ADC_SELFTEST_CAPACITIVE_STEP6                    STCFG_STSSEL(6)                             /*!< for capacitive self test step 6 */
#define ADC_SELFTEST_CAPACITIVE_STEP7                    STCFG_STSSEL(7)                             /*!< for capacitive self test step 7 */

/* ADC self test mode definitions */
#define STCFG_STMSEL(regval)                             (BITS(8,9) & ((uint32_t)(regval) << 8))     /*!< write value to ADC_STCFG_STMSEL bit field */
#define ADC_SELFTEST_SUPPLY                              STCFG_STMSEL(0)                             /*!< supply self test */
#define ADC_SELFTEST_CAPACITIVE                          STCFG_STMSEL(2)                             /*!< capacitive self test */
#define ADC_SELFTEST_SUPPLY_CAPACITIVE                   STCFG_STMSEL(3)                             /*!< supply and capacitive self test */

/* ADC self test error data definitions */
#define ADC_SELFTEST_SUPPLY_STEP0_DATA                   ((uint32_t)0x00000000U)                     /*!< error data of supply self test step 0 */
#define ADC_SELFTEST_SUPPLY_STEP1_DATA                   ((uint32_t)0x00000001U)                     /*!< error data of supply self test step 1 */
#define ADC_SELFTEST_SUPPLY_STEP2_DATA                   ((uint32_t)0x00000002U)                     /*!< error data of supply self test step 2 */
#define ADC_SELFTEST_CAPACITIVE_STEP_DATA                ((uint32_t)0x00000003U)                     /*!< error data of capacitive self test step */

/* ADC self test watchdog timer definitions */
#define STCFG_STWDT(regval)                              (BITS(24,26) & ((uint32_t)(regval) << 24))  /*!< write value to ADC_STCFG_STWDT bit field */
#define ADC_SELFTEST_TIME_0_1MS                          STCFG_STWDT(0)                              /*!< about 0.1ms at 15MHz ADC clock frequency */
#define ADC_SELFTEST_TIME_0_5MS                          STCFG_STWDT(1)                              /*!< about 0.5ms at 15MHz ADC clock frequency */
#define ADC_SELFTEST_TIME_1MS                            STCFG_STWDT(2)                              /*!< about 1ms at 15MHz ADC clock frequency */
#define ADC_SELFTEST_TIME_2MS                            STCFG_STWDT(3)                              /*!< about 2ms at 15MHz ADC clock frequency */
#define ADC_SELFTEST_TIME_5MS                            STCFG_STWDT(4)                              /*!< about 5ms at 15MHz ADC clock frequency */
#define ADC_SELFTEST_TIME_10MS                           STCFG_STWDT(5)                              /*!< about 10ms at 15MHz ADC clock frequency */
#define ADC_SELFTEST_TIME_20MS                           STCFG_STWDT(6)                              /*!< about 20ms at 15MHz ADC clock frequency */
#define ADC_SELFTEST_TIME_50MS                           STCFG_STWDT(7)                              /*!< about 50ms at 15MHz ADC clock frequency */

/* ADC self test register lock */
#define ADC_SELFTEST_REGISTER_UNLOCK                     ((uint32_t)0x00000000U)                     /*!< self test registers unlock */
#define ADC_SELFTEST_REGISTER_LOCK                       ADC_CTL_STLK                                /*!< self test registers lock */

/* DAC-ADC looptest definitions */
#define NO_DAC_SELECT                                    ((uint32_t)0x00000000U)                     /*!< do not select DAC */
#define DAC0_SELECT                                      ADC_DTALTCFG_DAC0SEL                        /*!< select DAC0_OUT0 as ADC input */
#define DAC1_SELECT                                      ADC_DTALTCFG_DAC1SEL                        /*!< select DAC1_OUT0 as ADC input */

/* ADC self test flag definitions */
#define ADC_SELFTEST_FLAG_STODE                          ADC_STSTAT_STODE                            /*!< self test step order error flag */
#define ADC_SELFTEST_FLAG_WDTE                           ADC_STSTAT_WDTE                             /*!< self test watchdog timer error flag */
#define ADC_SELFTEST_FLAG_CSTE                           ADC_STSTAT_CSTE                             /*!< self test capacitive error flag */
#define ADC_SELFTEST_FLAG_SSTE0                          ADC_STSTAT_SST0E                            /*!< self test supply step 0 error flag */
#define ADC_SELFTEST_FLAG_SSTE1                          ADC_STSTAT_SST1E                            /*!< self test supply step 1 error flag */
#define ADC_SELFTEST_FLAG_SSTE2                          ADC_STSTAT_SST2E                            /*!< self test supply step 2 error flag */
#define ADC_SELFTEST_FLAG_STEOVW                         ADC_STSTAT_STEOVW                           /*!< self test error overwrtie flag (SST2E, SST1E, SST0E, CERR bit)  */
#define ADC_SELFTEST_FLAG_EOSSTC                         ADC_STSTAT_EOSSTC                           /*!< end of all supply self test steps conversion flag */
#define ADC_SELFTEST_FLAG_EOCSTC                         ADC_STSTAT_EOCSTC                           /*!< end of all capacitive self test steps conversion */
#define ADC_SELFTEST_FLAG_EOSTC                          ADC_STSTAT_EOSTC                            /*!< end of self test conversion */

/* ADC self test interrupt definitions */
#define ADC_SELFTEST_INT_FMUSSTEIE                       ADC_STINTEN_FMUSSTEIE                       /*!< interrupt for supply self test error SSTxE to FMU */
#define ADC_SELFTEST_INT_FMUCSTEIE                       ADC_STINTEN_FMUCSTEIE                       /*!< interrupt for capacitive self test error CSTE to FMU */
#define ADC_SELFTEST_INT_FMUWDTEIE                       ADC_STINTEN_FMUWDTEIE                       /*!< interrupt for watchdog timer error WDTE to FMU */
#define ADC_SELFTEST_INT_FMUSTODEIE                      ADC_STINTEN_FMUSTODEIE                      /*!< interrupt for self test sequence error STODE to FMU */
#define ADC_SELFTEST_INT_STODEIE                         ADC_STINTEN_STODEIE                         /*!< interrupt for self test step order error */
#define ADC_SELFTEST_INT_WDTEIE                          ADC_STINTEN_WDTEIE                          /*!< interrupt for watchdog timer error */
#define ADC_SELFTEST_INT_CSTEIE                          ADC_STINTEN_CSTEIE                          /*!< interrupt for capacitive self test error */
#define ADC_SELFTEST_INT_SSTEIE0                         ADC_STINTEN_SST0EIE                         /*!< interrupt for supply self test step 0 error */
#define ADC_SELFTEST_INT_SSTEIE1                         ADC_STINTEN_SST1EIE                         /*!< interrupt for supply self test step 1 error */
#define ADC_SELFTEST_INT_SSTEIE2                         ADC_STINTEN_SST2EIE                         /*!< interrupt for supply self test step 2 error */
#define ADC_SELFTEST_INT_STEOVWIE                        ADC_STINTEN_STEOVWIE                        /*!< interrupt for self test error(SERR2, SERR1, SERR0, CERR) be overwrite */
#define ADC_SELFTEST_INT_EOSSTCIE                        ADC_STINTEN_EOSSTCIE                        /*!< interrupt for all supply selftest end */
#define ADC_SELFTEST_INT_EOCSTCIE                        ADC_STINTEN_EOCSTCIE                        /*!< interrupt for all capacitive self test end */
#define ADC_SELFTEST_INT_EOSTCIE                         ADC_STINTEN_EOSTCIE                         /*!< interrupt for all self test end */

/* ADC self test interrupt flag definitions */
#define ADC_SELFTEST_INT_FLAG_STODE                      ADC_STSTAT_STODE                            /*!< self test step order interrupt flag */
#define ADC_SELFTEST_INT_FLAG_WDTE                       ADC_STSTAT_WDTE                             /*!< self test watchdog timer error interrupt flag */
#define ADC_SELFTEST_INT_FLAG_CSTE                       ADC_STSTAT_CSTE                             /*!< self test capacitive error interrupt flag */
#define ADC_SELFTEST_INT_FLAG_SSTE0                      ADC_STSTAT_SST0E                            /*!< self test supply step 0 error interrupt flag */
#define ADC_SELFTEST_INT_FLAG_SSTE1                      ADC_STSTAT_SST1E                            /*!< self test supply step 1 error interrupt flag */
#define ADC_SELFTEST_INT_FLAG_SSTE2                      ADC_STSTAT_SST2E                            /*!< self test supply step 2 error interrupt flag */
#define ADC_SELFTEST_INT_FLAG_STEOVW                     ADC_STSTAT_STEOVW                           /*!< self test error overwrtie interrupt flag (SST2E, SST1E, SST0E, CERR bit)  */
#define ADC_SELFTEST_INT_FLAG_EOSSTC                     ADC_STSTAT_EOSSTC                           /*!< end of all supply self test steps conversion interrupt flag */
#define ADC_SELFTEST_INT_FLAG_EOCSTC                     ADC_STSTAT_EOCSTC                           /*!< end of all capacitive self test steps conversion interrupt flag */
#define ADC_SELFTEST_INT_FLAG_EOSTC                      ADC_STSTAT_EOSTC                            /*!< end of self test conversion interrupt flag */

/* the reset value of ADC registers */
#define ADC_RESET_VALUE                                  ((uint32_t)0x00000000U)                     /*!< the reset value of register */
#define ADC_STAT_RESET_VALUE                             ((uint32_t)0x00003F00U)                     /*!< the reset value of ADC_STAT register */
#define ADC_SSTWDCFG0_RESET_VALUE                        ((uint32_t)0x00100000U)                     /*!< the reset value of ADC_SSTWDCFG0 register */
#define ADC_SSTWDCFG1_RESET_VALUE                        ((uint32_t)0x07680348U)                     /*!< the reset value of ADC_SSTWDCFG1 register */
#define ADC_SSTWDCFG2_RESET_VALUE                        ((uint32_t)0x00000FEFU)                     /*!< the reset value of ADC_SSTWDCFG2 register */
#define ADC_CSTWDCFGx_RESET_VALUE                        ((uint32_t)0x00300030U)                     /*!< the reset value of ADC_CSTWDCFGx(x = 0..2) register */
#define ADC_CSTWDCFG3_RESET_VALUE                        ((uint32_t)0x000C0018U)                     /*!< the reset value of ADC_CSTWDCFG3 register */


/* constants definitions */
/* break parameter struct definitions */
typedef struct {
    uint32_t time;                                                              /*!< ADC presample time, it can be 0~638 */
    uint32_t volselect;                                                         /*!< voltage select */
    uint32_t follow;                                                            /*!< controls whether to convert the presampled value after presampling */
    ControlStatus enable;                                                       /*!< presample enable  */
} adc_presample_parameter_struct;
