sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT

/* check peripherals */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_ADC_periph(adc_periph)                       (((adc_periph) != ADC0) && ((adc_periph) != ADC1) && ((adc_periph) != ADC2))
#else
#define NOT_ADC_periph(adc_periph)                       (((adc_periph) != ADC0) && ((adc_periph) != ADC1))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* check data alignment */
#define NOT_ADC_DATA_ALIGNMENT(data_alignment)           (((data_alignment) != ADC_DATAALIGN_RIGHT) && ((data_alignment) != ADC_DATAALIGN_LEFT))

/* check ADC resolution */
#define NOT_ADC_RESOLUTION(resolution)                   (((resolution) != ADC_RESOLUTION_12B) && ((resolution) != ADC_RESOLUTION_10B) && \
                                                         ((resolution) != ADC_RESOLUTION_8B)   && ((resolution) != ADC_RESOLUTION_6B))

/* check ADC modes */
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
#define NOT_ADC_mode(mode)                               (((mode) != ADC_MODE_FREE)                     && ((mode) != ADC_DUAL_ROUTINE_PARALLEL_INSERTED_PARALLEL) && \
                                                         ((mode) != ADC_DUAL_ROUTINE_PARALLEL_ROTATION) && ((mode) != ADC_DUAL_INSERTED_PARALLEL) && \
                                                         ((mode) != ADC_DUAL_ROUTINE_PARALLEL)          && ((mode) != ADC_DUAL_FOLLOWUP) && \
                                                         ((mode) != ADC_DUAL_TRRIGGER_ROTATION)         && ((mode) != ADC_ALL_ROUTINE_PARALLEL_INSERTED_PARALLEL) && \
                                                         ((mode) != ADC_ALL_ROUTINE_PARALLEL_ROTATION)  && ((mode) != ADC_ALL_INSERTED_PARALLEL) && \
                                                         ((mode) != ADC_ALL_ROUTINE_PARALLEL)           && ((mode) != ADC_ALL_FOLLOWUP) && ((mode) != ADC_ALL_TRRIGGER_ROTATION))
#else
#define NOT_ADC_mode(mode)                               (((mode) != ADC_MODE_FREE)                     && ((mode) != ADC_DUAL_ROUTINE_PARALLEL_INSERTED_PARALLEL) && \
                                                         ((mode) != ADC_DUAL_ROUTINE_PARALLEL_ROTATION) && ((mode) != ADC_DUAL_INSERTED_PARALLEL) && \
                                                         ((mode) != ADC_DUAL_ROUTINE_PARALLEL)          && ((mode) != ADC_DUAL_FOLLOWUP) && \
                                                         ((mode) != ADC_DUAL_TRRIGGER_ROTATION))
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/* check internal channels */
#define NOT_ADC_INTERNAL_CHANNEL(internal_channel)       (((internal_channel) != ADC_CHANNEL_INTERNAL_VREFINT) && ((internal_channel) != ADC_CHANNEL_INTERNAL_HP_TEMPSENSOR))

/* check ENABLE and DISABLE */
#define NOT_ADC_ENABLE_DISABLE(newvalue)                 (((newvalue) != ENABLE)  && ((newvalue) != DISABLE))

/* check ADC calibration mode */
#define NOT_ADC_CALIBRATION_MODE(clb_mode)               (((clb_mode) != ADC_CALIBRATION_OFFSET_MISMATCH) && ((clb_mode) != ADC_CALIBRATION_OFFSET))

/* check calibration number */
#define NOT_ADC_CALIBRATION_NUMBER(cal_num)              (((cal_num) != ADC_CALIBRATION_NUM1) && ((cal_num) != ADC_CALIBRATION_NUM3) && \
                                                         ((cal_num) != ADC_CALIBRATION_NUM7)  && ((cal_num) != ADC_CALIBRATION_NUM15) && \
                                                         ((cal_num) != ADC_CALIBRATION_NUM31))

/* check ADC sequences */
#define NOT_ADC_SEQUENCE(adc_sequence)                   (((adc_sequence) != ADC_ROUTINE_SEQUENCE)  && ((adc_sequence) != ADC_INSERTED_SEQUENCE0) && \
                                                         ((adc_sequence) != ADC_INSERTED_SEQUENCE1) && ((adc_sequence) != ADC_INSERTED_SEQUENCE2) && \
                                                         ((adc_sequence) != ADC_INSERTED_SEQUENCE3) && ((adc_sequence) != ADC_INSERTED_SEQUENCE4) && \
                                                         ((adc_sequence) != ADC_INSERTED_SEQUENCE5))

/* check ADC inserted sequences */
#define NOT_ADC_INSERTED_SEQUENCE(inserted_sequence)     (((inserted_sequence) != ADC_INSERTED_SEQUENCE_NONE)  && ((inserted_sequence) != ADC_INSERTED_SEQUENCE0) && \
                                                         ((inserted_sequence) != ADC_INSERTED_SEQUENCE1) && ((inserted_sequence) != ADC_INSERTED_SEQUENCE2) && \
                                                         ((inserted_sequence) != ADC_INSERTED_SEQUENCE3) && ((inserted_sequence) != ADC_INSERTED_SEQUENCE4) && \
                                                         ((inserted_sequence) != ADC_INSERTED_SEQUENCE5))

/* check routine sequence rank */
#define ADC_ROUTINE_RANK_HIGH                            ((uint32_t)0x0000001BU)
#define NOT_ADC_SEQUENCE_RANK(rank)                      (ADC_ROUTINE_RANK_HIGH < (rank))

/* check average number */
#define NOT_ADC_AVERAGE_NUMBER(aver_num)                 (((aver_num) != ADC_AVERAGE_2_CONVERSIONS)  && ((aver_num) != ADC_AVERAGE_4_CONVERSIONS)  && \
                                                         ((aver_num) != ADC_AVERAGE_8_CONVERSIONS)   && ((aver_num) != ADC_AVERAGE_16_CONVERSIONS) && \
                                                         ((aver_num) != ADC_AVERAGE_32_CONVERSIONS)  && ((aver_num) != ADC_AVERAGE_64_CONVERSIONS) && \
                                                         ((aver_num) != ADC_AVERAGE_128_CONVERSIONS) && ((aver_num) != ADC_AVERAGE_256_CONVERSIONS))

/* check auto clock configure */
#define NOT_ADC_AUTO_CLOCK(ack_cfg)                      (((ack_cfg) != ADC_CLOCK_IDLE_STATE_ON) && ((ack_cfg) != ADC_CLOCK_IDLE_STATE_OFF))

/* check external decode signals delay */
#define ADC_DECODE_SIGNAL_DELAY_HIGH                     ((uint32_t)0x0000FFFFU)
#define NOT_ADC_DECODE_SIGNAL_DELAY(external_delay)      (ADC_DECODE_SIGNAL_DELAY_HIGH < (external_delay))

/* check start conversion delay */
#define ADC_START_CONVERSION_DELAY_HIGH                  ((uint32_t)0x0000FFFFU)
#define NOT_ADC_START_CONVERSION_DELAY(cs_delay)         (ADC_START_CONVERSION_DELAY_HIGH < (cs_delay))

/* check start conversion delay enable sequence */
#define NOT_ADC_DELAY_ENABLE_SEQUENCE(cs_sequence)       (((cs_sequence) != ADC_ROUTINE_SEQUENCE_TRIGGER_DELAY)  && ((cs_sequence) != ADC_INSERTED_SEQUENCE0_TRIGGER_DELAY) && \
                                                         ((cs_sequence) != ADC_INSERTED_SEQUENCE1_TRIGGER_DELAY) && ((cs_sequence) != ADC_INSERTED_SEQUENCE2_TRIGGER_DELAY) && \
                                                         ((cs_sequence) != ADC_INSERTED_SEQUENCE3_TRIGGER_DELAY) && ((cs_sequence) != ADC_INSERTED_SEQUENCE4_TRIGGER_DELAY) && \
                                                         ((cs_sequence) != ADC_INSERTED_SEQUENCE5_TRIGGER_DELAY))

/* check start conversion delay disable sequence */
#define NOT_ADC_DELAY_DISABLE_SEQUENCE(cs_sequence)      (((cs_sequence) != ADC_ROUTINE_SEQUENCE_TRIGGER_DELAY)  && ((cs_sequence) != ADC_INSERTED_SEQUENCE0_TRIGGER_DELAY) && \
                                                         ((cs_sequence) != ADC_INSERTED_SEQUENCE1_TRIGGER_DELAY) && ((cs_sequence) != ADC_INSERTED_SEQUENCE2_TRIGGER_DELAY) && \
                                                         ((cs_sequence) != ADC_INSERTED_SEQUENCE3_TRIGGER_DELAY) && ((cs_sequence) != ADC_INSERTED_SEQUENCE4_TRIGGER_DELAY) && \
                                                         ((cs_sequence) != ADC_INSERTED_SEQUENCE5_TRIGGER_DELAY) && ((cs_sequence) != ADC_ALL_TRIGGER_DELAY_DISABLE))

/* check recovery sequence conversion */
#define NOT_ADC_RECOVERY_CONVERSION(adc_resel)           (((adc_resel) != ADC_RESUME_SEQUENCE) && ((adc_resel) != ADC_RESTART_SEQUENCE))

/* check gain factor */
#define ADC_GAIN_FACTOR_HIGH                             ((uint32_t)0x00003FFFU)
#define NOT_ADC_GAIN_FACTOR(gain_factor)                 (ADC_GAIN_FACTOR_HIGH < (gain_factor))

/* check offset number */
#define ADC_OFFSET_NUMBER_HIGH                           ((uint32_t)0x00000003U)
#define NOT_ADC_OFFSET_NUMBER(off_num)                   (ADC_OFFSET_NUMBER_HIGH < (off_num))

/* check offset factor */
#define ADC_OFFSET_FACTOR_HIGH                           ((uint32_t)0x00000FFFU)
#define NOT_ADC_OFFSET_FACTOR(off_factor)                (ADC_OFFSET_FACTOR_HIGH < (off_factor))

/* check offset channel */
#define ADC_OFFSET_CHANNEL_HIGH                          ((uint32_t)0x0000003DU)
#define NOT_ADC_OFFSET_CHANNEL(off_ch)                   (ADC_OFFSET_CHANNEL_HIGH < (off_ch))

