sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* check offset positive or negative */
#define NOT_ADC_OFFSET_POSITIVE(off_pos)                 (((off_pos) != ADC_NEGATIVE_OFFSET) && ((off_pos) != ADC_POSITIVE_OFFSET))

/* check ADC channel */
#define ADC_CHANNEL_HIGH                                 ((uint32_t)0x0000003DU)
#define NOT_ADC_CHANNEL(adc_channel)                     (ADC_CHANNEL_HIGH < (adc_channel))
#define NOT_ADC_WATCHDOG_CHANNEL(adc_channel)            ((ADC_CHANNEL_HIGH < (adc_channel)) && (0xFFFFFFFFU != (adc_channel)))

/* check sample/presample/selftest time */
#define ADC_SAMPLE_TIME_HIGH                             ((uint32_t)0x0000027EU)
#define NOT_ADC_SAMPLE_TIME(sample_time)                 (ADC_SAMPLE_TIME_HIGH < (sample_time))

/* check routine sequence conversion mode */
#define NOT_ADC_ROUTINE_MODE(adc_mode)                   (((adc_mode) != ADC_ONE_SHOT_MODE) && ((adc_mode) != ADC_CONTINUOUS_MODE))

/* check external trigger */
#define NOT_ADC_TRIGGER(adc_trigger)                     (((adc_trigger) != ADC_EXTERNAL_TRIGGER_DISABLE)     && ((adc_trigger) != ADC_EXTERNAL_TRIGGER_RISING_EDGE) && \
                                                         ((adc_trigger) != ADC_EXTERNAL_TRIGGER_FALLING_EDGE) && ((adc_trigger) != ADC_EXTERNAL_TRIGGER_RISING_FALLING_EDGE))

/* check voltage select */
#define NOT_ADC_VOLTAGE_SELECT(vol_select)               (((vol_select) != ADC_PSMPVSEL_VREFN) && ((vol_select) != ADC_PSMPVSEL_VREFP))

/* check whether to convert the presampled value after presampling */
#define NOT_ADC_CONVERSION_AFTER_PRESAMPLE(follow)       (((follow) != ADC_NO_CONVERSION_AFTER_PRESAMPLE) && ((follow) != ADC_PRESAMPLE_FOLLOW_CONVERSION))

/* check analog watchdog */
#define NOT_ADC_ANALOG_WATCHDOG(awd_sel)                 (((awd_sel) != ADC_ANALOG_WATCHDOG0) && ((awd_sel) != ADC_ANALOG_WATCHDOG1) && \
                                                         ((awd_sel) != ADC_ANALOG_WATCHDOG2)  && ((awd_sel) != ADC_ANALOG_WATCHDOG3))

/* check analog watchdog event */
#define NOT_ADC_ANALOG_WATCHDOG_EVENT(awd_event)         (((awd_event) != ADC_ANALOG_WATCHDOG_DISABLE) && ((awd_event) != ADC_RESULT_WDLT) && \
                                                         ((awd_event) != ADC_WDLT_RESULT_WDHT)         && ((awd_event) != ADC_WDHT_RESULT) && \
                                                         ((awd_event) != ADC_WDLT_RESULT)              && ((awd_event) != ADC_WDHT_RESULT_WDLT) && ((awd_event) != ADC_RESULT_WDHT))

/* check analog watchdog high/low threshold */
#define ADC_WATCHDOG_THRESHOLD_HIGH                      ((uint32_t)0x00000FFFU)
#define NOT_ADC_WATCHDOG_THRESHOLD(threshold)            (ADC_WATCHDOG_THRESHOLD_HIGH < (threshold))

/* check stream counter value */
#define ADC_STREAM_COUNTER_VALUE_LOW                     ((uint32_t)0x00000001U)
#define ADC_STREAM_COUNTER_VALUE_HIGH                    ((uint32_t)0x00010000U)
#define NOT_ADC_STREAM_COUNTER_VALUE(counter)            ((ADC_STREAM_COUNTER_VALUE_LOW > (counter)) || (ADC_STREAM_COUNTER_VALUE_HIGH < (counter)))


/* check selftest mode */
#define NOT_ADC_SELFTEST_MODE(adc_selftest)               (((adc_selftest) != ADC_SELFTEST_SUPPLY) && ((adc_selftest) != ADC_SELFTEST_CAPACITIVE) && \
                                                          ((adc_selftest) != ADC_SELFTEST_SUPPLY_CAPACITIVE))

/* check supply/capacitive selftest mode */
#define NOT_ADC_SELFTEST_MODE_SUP_CAP(adc_selftest)       (((adc_selftest) != ADC_SELFTEST_SUPPLY) && ((adc_selftest) != ADC_SELFTEST_CAPACITIVE))

/* check selftest steps   */
#define NOT_ADC_SELFTEST_STEP(st_step)                   (((st_step) != ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP0) && ((st_step) != ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP1) && \
                                                         ((st_step) != ADC_SELFTEST_SUPPLY_CAPACITIVE_STEP2)  && ((st_step) != ADC_SELFTEST_CAPACITIVE_STEP3) && \
                                                         ((st_step) != ADC_SELFTEST_CAPACITIVE_STEP4)         && ((st_step) != ADC_SELFTEST_CAPACITIVE_STEP5) && \
                                                         ((st_step) != ADC_SELFTEST_CAPACITIVE_STEP6)         && ((st_step) != ADC_SELFTEST_CAPACITIVE_STEP7))

/* check self test execute rate */
#define ADC_SELFTEST_RATE_LOW                            ((uint32_t)0x00000001U)
#define ADC_SELFTEST_RATE_HIGH                           ((uint32_t)0x00000100U)
#define NOT_ADC_SELFTEST_RATE(st_rate)                   ((ADC_SELFTEST_RATE_LOW > (st_rate)) || (ADC_SELFTEST_RATE_HIGH < (st_rate)))


/* check selftest step data */
#define NOT_ADC_SELFTEST_STEP_DATA(st_data)              (((st_data) != ADC_SELFTEST_SUPPLY_STEP0_DATA) && ((st_data) != ADC_SELFTEST_SUPPLY_STEP1_DATA) && \
                                                         ((st_data) != ADC_SELFTEST_SUPPLY_STEP2_DATA)  && ((st_data) != ADC_SELFTEST_CAPACITIVE_STEP_DATA))

/* check selftest high/low threshold */
#define ADC_SELFTEST_THRESHOLD_HIGH                      ((uint32_t)0x00000FFFU)
#define NOT_ADC_SELFTEST_THRESHOLD(threshold)            (ADC_SELFTEST_THRESHOLD_HIGH < (threshold))

/* check self test safe time */
#define NOT_ADC_SELFTEST_SAFE_TIME(st_time)              (((st_time) != ADC_SELFTEST_TIME_0_1MS) && ((st_time) != ADC_SELFTEST_TIME_0_5MS) && \
                                                         ((st_time) != ADC_SELFTEST_TIME_1MS)    && ((st_time) != ADC_SELFTEST_TIME_2MS)   && \
                                                         ((st_time) != ADC_SELFTEST_TIME_5MS)    && ((st_time) != ADC_SELFTEST_TIME_10MS)  && \
                                                         ((st_time) != ADC_SELFTEST_TIME_20MS)   && ((st_time) != ADC_SELFTEST_TIME_50MS))

/* check self test registers lock state */
#define NOT_ADC_SELFTEST_LOCK(state)                     (((state) != ADC_SELFTEST_REGISTER_UNLOCK) && ((state) != ADC_SELFTEST_REGISTER_LOCK))

/* check loop test threshold value */
#define ADC_LOOPTEST_THRESHOLD_HIGH                      ((uint32_t)0x000000FFU)
#define NOT_ADC_LOOPTEST_THRESHOLD(threshold)            (ADC_LOOPTEST_THRESHOLD_HIGH < (threshold))

/* check loop test DAC select */
#define NOT_ADC_LOOPTEST_DAC(dac_select)                 (((dac_select) != NO_DAC_SELECT) && ((dac_select) != DAC0_SELECT) && ((dac_select) != DAC1_SELECT))

/* check ADC current state */
#define NOT_ADC_STATE(state)                             (((state) != ADC_STATE_IDLE) && ((state) != ADC_STATE_WAIT)  && \
                                                         ((state) != ADC_STATE_PSAMP) && ((state) != ADC_STATE_EDDLY) && \
                                                         ((state) != ADC_STATE_SAMP)  && ((state) != ADC_STATE_CONV))

/* check ADC flags */
#define NOT_ADC_FLAG(flag)                               (((flag) != ADC_FLAG_ACTST)  && ((flag) != ADC_FLAG_EORC)  && \
                                                         ((flag) != ADC_FLAG_EOI0C)   && ((flag) != ADC_FLAG_EOI1C) && \
                                                         ((flag) != ADC_FLAG_EOI2C)   && ((flag) != ADC_FLAG_EOI3C) && \
                                                         ((flag) != ADC_FLAG_EOI4C)   && ((flag) != ADC_FLAG_EOI5C) && \
                                                         ((flag) != ADC_FLAG_EORCHC)  && ((flag) != ADC_FLAG_EOI0CHC) && \
                                                         ((flag) != ADC_FLAG_EOI1CHC) && ((flag) != ADC_FLAG_EOI2CHC) && \
                                                         ((flag) != ADC_FLAG_EOI3CHC) && ((flag) != ADC_FLAG_EOI4CHC) && \
                                                         ((flag) != ADC_FLAG_EOI5CHC))


