sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* check ADC error flags  */
#define NOT_ADC_ERROR_FLAG(error_flag)                   (((error_flag) != ADC_FLAG_RSUSPDF) && ((error_flag) != ADC_FLAG_RABORTF)  && \
                                                         ((error_flag) != ADC_FLAG_RTRGE)    && ((error_flag) != ADC_FLAG_I0SUSPDF) && \
                                                         ((error_flag) != ADC_FLAG_I0ABORTF) && ((error_flag) != ADC_FLAG_I0TRGE)   && \
                                                         ((error_flag) != ADC_FLAG_I1SUSPDF) && ((error_flag) != ADC_FLAG_I1ABORTF) && \
                                                         ((error_flag) != ADC_FLAG_I1TRGE)   && ((error_flag) != ADC_FLAG_I2SUSPDF) && \
                                                         ((error_flag) != ADC_FLAG_I2ABORTF) && ((error_flag) != ADC_FLAG_I2TRGE)   && \
                                                         ((error_flag) != ADC_FLAG_I3SUSPDF) && ((error_flag) != ADC_FLAG_I3ABORTF) && \
                                                         ((error_flag) != ADC_FLAG_I3TRGE)   && ((error_flag) != ADC_FLAG_I4SUSPDF) && \
                                                         ((error_flag) != ADC_FLAG_I4ABORTF) && ((error_flag) != ADC_FLAG_I4TRGE)   && \
                                                         ((error_flag) != ADC_FLAG_I5ABORTF) && ((error_flag) != ADC_FLAG_I5TRGE)   && \
                                                         ((error_flag) != ADC_FLAG_WDE)      && ((error_flag) != ADC_FLAG_LTE))


/* check ADC interrupt */
#define NOT_ADC_INTERRUPT(interrupt)                     (((interrupt) != ADC_INT_RTRGEIE)         && ((interrupt) != ADC_INT_EORCIE)          && \
                                                         ((interrupt) != ADC_INT_RSTREAMIE)        && ((interrupt) != ADC_INT_ITRGEIE)         && \
                                                         ((interrupt) != ADC_INT_IEOCIE)           && ((interrupt) != ADC_INT_ISTREAMIE)       && \
                                                         ((interrupt) != ADC_INT_ANALOG_WATCHDOG0) && ((interrupt) != ADC_INT_ANALOG_WATCHDOG1) && \
                                                         ((interrupt) != ADC_INT_ANALOG_WATCHDOG2) && ((interrupt) != ADC_INT_ANALOG_WATCHDOG3) && \
                                                         ((interrupt) != ADC_INT_LOOPTEST)         && ((interrupt) != ADC_INT_OVERWRITE)        && \
                                                         ((interrupt) != ADC_INT_CHOVERWRITE))

/* check ADC interrupt flags */
#define NOT_ADC_INTERRUPT_FLAG(int_flag)                 (((int_flag) != ADC_INT_FLAG_EORC)   && ((int_flag) != ADC_INT_FLAG_EOI0C)   && \
                                                         ((int_flag) != ADC_INT_FLAG_EOI1C)   && ((int_flag) != ADC_INT_FLAG_EOI2C)   && \
                                                         ((int_flag) != ADC_INT_FLAG_EOI3C)   && ((int_flag) != ADC_INT_FLAG_EOI4C)   && \
                                                         ((int_flag) != ADC_INT_FLAG_EOI5C)   && ((int_flag) != ADC_INT_FLAG_EORCHC)  && \
                                                         ((int_flag) != ADC_INT_FLAG_EOI0CHC) && ((int_flag) != ADC_INT_FLAG_EOI1CHC) && \
                                                         ((int_flag) != ADC_INT_FLAG_EOI2CHC) && ((int_flag) != ADC_INT_FLAG_EOI3CHC) && \
                                                         ((int_flag) != ADC_INT_FLAG_EOI4CHC) && ((int_flag) != ADC_INT_FLAG_EOI5CHC) && \
                                                         ((int_flag) != ADC_INT_FLAG_RTRGE)   && ((int_flag) != ADC_INT_FLAG_I0TRGE)  && \
                                                         ((int_flag) != ADC_INT_FLAG_I1TRGE)  && ((int_flag) != ADC_INT_FLAG_I2TRGE)  && \
                                                         ((int_flag) != ADC_INT_FLAG_I3TRGE)  && ((int_flag) != ADC_INT_FLAG_I4TRGE)  && \
                                                         ((int_flag) != ADC_INT_FLAG_I5TRGE)  && ((int_flag) != ADC_INT_FLAG_LTE))


/* check ADC ADC self test flags */
#define NOT_ADC_SELFTEST_FLAG(flag)                      (((flag) != ADC_SELFTEST_FLAG_STODE) && ((flag) != ADC_SELFTEST_FLAG_WDTE)   && \
                                                         ((flag) != ADC_SELFTEST_FLAG_CSTE)   && ((flag) != ADC_SELFTEST_FLAG_SSTE0)  && \
                                                         ((flag) != ADC_SELFTEST_FLAG_SSTE1)  && ((flag) != ADC_SELFTEST_FLAG_SSTE2)  && \
                                                         ((flag) != ADC_SELFTEST_FLAG_STEOVW) && ((flag) != ADC_SELFTEST_FLAG_EOSSTC) && \
                                                         ((flag) != ADC_SELFTEST_FLAG_EOCSTC) && ((flag) != ADC_SELFTEST_FLAG_EOSTC))

/* check ADC selftest interrupt */
#define NOT_ADC_SELFTEST_INTERRUPT(interrupt)            (((interrupt) != ADC_SELFTEST_INT_FMUSSTEIE) && ((interrupt) != ADC_SELFTEST_INT_FMUCSTEIE)  && \
                                                         ((interrupt) != ADC_SELFTEST_INT_FMUWDTEIE)  && ((interrupt) != ADC_SELFTEST_INT_FMUSTODEIE) && \
                                                         ((interrupt) != ADC_SELFTEST_INT_STODEIE)    && ((interrupt) != ADC_SELFTEST_INT_WDTEIE)     && \
                                                         ((interrupt) != ADC_SELFTEST_INT_CSTEIE)     && ((interrupt) != ADC_SELFTEST_INT_SSTEIE0)    && \
                                                         ((interrupt) != ADC_SELFTEST_INT_SSTEIE1)    && ((interrupt) != ADC_SELFTEST_INT_SSTEIE2)    && \
                                                         ((interrupt) != ADC_SELFTEST_INT_STEOVWIE)   && ((interrupt) != ADC_SELFTEST_INT_EOSSTCIE)   && \
                                                         ((interrupt) != ADC_SELFTEST_INT_EOCSTCIE)   && ((interrupt) != ADC_SELFTEST_INT_EOSTCIE))

/* check ADC selftest interrupt flags */
#define NOT_ADC_SELFTEST_INTERRUPT_FLAG(int_flag)        (((int_flag) != ADC_SELFTEST_INT_FLAG_STODE) && ((int_flag) != ADC_SELFTEST_INT_FLAG_WDTE)   && \
                                                         ((int_flag) != ADC_SELFTEST_INT_FLAG_CSTE)   && ((int_flag) != ADC_SELFTEST_INT_FLAG_SSTE0)  && \
                                                         ((int_flag) != ADC_SELFTEST_INT_FLAG_SSTE1)  && ((int_flag) != ADC_SELFTEST_INT_FLAG_SSTE2)  && \
                                                         ((int_flag) != ADC_SELFTEST_INT_FLAG_STEOVW) && ((int_flag) != ADC_SELFTEST_INT_FLAG_EOSSTC) && \
                                                         ((int_flag) != ADC_SELFTEST_INT_FLAG_EOCSTC) && ((int_flag) != ADC_SELFTEST_INT_FLAG_EOSTC))
#endif /* FW_DEBUG_ERR_REPORT */

/* calibration timeout */
#define ADC_CALIBRATION_TIMEROUT                         ((uint32_t)0x00FFFFFFU)

/* function declarations */
/* initialization configure */
/* reset ADC */
void adc_deinit(uint32_t adc_periph);
/* enable ADC interface */
void adc_enable(uint32_t adc_periph);
/* disable ADC interface */
void adc_disable(uint32_t adc_periph);
/* configure ADC data alignment */
void adc_data_alignment_config(uint32_t adc_periph, uint32_t data_alignment);
/* configure ADC resolution */
void adc_resolution_config(uint32_t adc_periph, uint32_t resolution);
/* configure the ADC mode */
void adc_mode_config(uint32_t mode);
/* configure ADC internal channels */
void adc_internal_channel_config(uint32_t adc_periph, uint32_t internal_channel, ControlStatus newvalue);
/* ADC calibration mode configure */
void adc_calibration_mode_config(uint32_t adc_periph, uint32_t clb_mode);
/* configure ADC calibration number */
void adc_calibration_number(uint32_t adc_periph, uint32_t cal_num);
/* ADC calibration and reset calibration */
ErrStatus adc_calibration_enable(uint32_t adc_periph);

/* DMA configure */
/* enable DMA request */
void adc_dma_mode_enable(uint32_t adc_periph);
/* disable DMA request */
void adc_dma_mode_disable(uint32_t adc_periph);
/* enable ADC sequence DMA request */
void adc_sequence_dma_enable(uint32_t adc_periph, uint32_t adc_sequence);
/* disable ADC sequence DMA request */
void adc_sequence_dma_disable(uint32_t adc_periph, uint32_t adc_sequence);
/* enable ADC sequence channel dma request */
void adc_sequence_channel_dma_enable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* disable ADC sequence channel dma request */
void adc_sequence_channel_dma_disable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* when DMA=1, the DMA engine issues a request at end of each conversion */
void adc_dma_request_after_last_enable(uint32_t adc_periph, uint32_t adc_sequence);
/* the DMA engine is disabled after the end of transfer signal from DMA controller is detected  */
void adc_dma_request_after_last_disable(uint32_t adc_periph, uint32_t adc_sequence);

/* ADC special function functions */
/* configure ADC average mode */
void adc_average_config(uint32_t adc_periph, ControlStatus newvalue);
/* configure ADC average number */
void adc_average_number_config(uint32_t adc_periph, uint32_t aver_num);
/* configure ADC overwrite mode */
void adc_overwrite_config(uint32_t adc_periph, ControlStatus newvalue);
/* configure ADC clock in idle */
void adc_auto_clock_config(uint32_t adc_periph, uint32_t ack_cfg);
/* configure the ADC external analog multiplexers decode signals delay */
void adc_external_decode_signals_delay_config(uint32_t adc_periph, uint32_t external_delay);
/* configure the ADC convert start delay */
void adc_convert_start_delay_config(uint32_t adc_periph, uint32_t cs_delay);
/* enable the ADC convert start delay sequence */
void adc_convert_start_delay_enable(uint32_t adc_periph, uint32_t cs_sequence);
/* disable the ADC convert start delay sequence */
void adc_convert_start_delay_disable(uint32_t adc_periph, uint32_t cs_sequence);
/* configure ADC restart or resume sequence when this sequence be suspended */
void adc_restart_resume_sequence_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t adc_resel);
/* abort ADC current sequence conversion */
void adc_sequence_abort(uint32_t adc_periph, uint32_t adc_sequence);

