sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* ADC gain and offset mode functions */
/* configure ADC gain */
void adc_gain_config(uint32_t adc_periph, ControlStatus newvalue);
/* configure ADC gain factor */
void adc_gain_factor_config(uint32_t adc_periph, uint32_t gain_factor);
/* configure ADC offset y mode */
void adc_offset_config(uint32_t adc_periph, uint32_t off_num, ControlStatus newvalue);
/* configure the ADC offset function parameters */
void adc_offset_parameter_config(uint32_t adc_periph, uint32_t off_num, uint32_t off_factor, uint32_t off_ch, uint32_t off_pos);
/* configure ADC data signed mode */
void adc_signed_data_configure(uint32_t adc_periph, uint32_t off_num, ControlStatus newvalue);

/* ADC channel configuration functions */
/* configure the length of routine sequence or inserted sequence */
void adc_channel_length_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t length);
/* configure ADC sequence channel */
void adc_sequence_channel_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank, uint32_t adc_channel, uint32_t sample_time);
/* configure the routine sequence conversion mode */
void adc_routine_sequence_conversion_mode_config(uint32_t adc_periph, uint32_t adc_mode);
/* configure ADC external trigger mode for channel */
void adc_external_trigger_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t adc_trigger);
/* enable ADC sequence software trigger */
void adc_sequence_software_trigger_enable(uint32_t adc_periph, uint32_t adc_sequence);
/* configure ADC channel pre-sample function */
void adc_channel_presample_config(uint32_t adc_periph, uint32_t adc_channel, adc_presample_parameter_struct *presamplepara);

/* get channel data */
/* read ADC sequence channel data register */
uint16_t adc_channel_data_read(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* read ADC sequence data register */
uint16_t adc_sequence_data_read(uint32_t adc_periph, uint32_t adc_sequence);

/* ADC analog watchdog functions */
/* configure ADC channel analog watchdog events */
void adc_channel_analog_watchdog_event_config(uint32_t adc_periph, uint32_t adc_channel, uint32_t awd_sel, uint32_t awd_event);
/* configure the ADC analog watchdog threshold value */
void adc_watchdog_threshold_config(uint32_t adc_periph, uint32_t awd_sel, uint32_t low_value, uint32_t high_value);

/* ADC stream mode functions */
/* configure ADC sequence stream mode */
void adc_stream_mode_config(uint32_t adc_periph, uint32_t adc_sequence, ControlStatus newvalue);
/* configure ADC sequence stream counter value */
void adc_stream_counter_value_config(uint32_t adc_periph, uint32_t adc_sequence, uint32_t counter);
/* configure ADC sequence stream mode reload */
void adc_stream_mode_reload_config(uint32_t adc_periph, uint32_t adc_sequence, ControlStatus newvalue);

/* ADC selftest functions */
/* configure ADC self test */
void adc_selftest_configure(uint32_t adc_periph, ControlStatus newvalue);
/* configure the self test capacitive and supply sample time */
void adc_selftest_sample_time_config(uint32_t adc_periph, uint32_t adc_selftest, uint32_t ssamp, uint32_t csamp);
/* select the capacitive and supply self test steps in one shot mode */
void adc_selftest_step_select_in_oneshot_mode(uint32_t adc_periph, uint32_t st_step);
/* configure the self test mode */
void adc_selftest_mode_config(uint32_t adc_periph, uint32_t adc_selftest);
/* configure the self test execution rate in continous mode */
void adc_selftest_rate_config(uint32_t adc_periph, uint32_t st_rate);
/* read the self test error data */
uint32_t adc_selftest_error_data_read(uint32_t adc_periph, uint32_t st_data);
/* read the self test data */
uint32_t adc_selftest_data_read(uint32_t adc_periph);
/* get the self test capacitive occurred error step */
uint32_t adc_selftest_capacitive_error_step_get(uint32_t adc_periph);
/* get the self test which step converted result */
uint32_t adc_selftest_converted_step_get(uint32_t adc_periph);
/* get the status of  self test previous conversion data whether was overwritten without read */
FlagStatus adc_selftest_overwrite_status_get(uint32_t adc_periph);
/* get the status of  self test whether new conversion data is available */
FlagStatus adc_selftest_conversion_data_available_get(uint32_t adc_periph);
/* configure the self test analog watchdog threshold value */
void adc_selftest_analog_watchdog_step_threshold_config(uint32_t adc_periph, uint32_t st_sel, uint32_t st_step, uint32_t low_thl, uint32_t high_thl);
/* configure the self test watchdog */
void adc_selftest_analog_watchdog_config(uint32_t adc_periph, uint32_t st_sel, uint32_t st_step, ControlStatus newvalue);
/* configure the self test watchdog timer safe time */
void adc_selftest_watchdog_timer_safe_time_config(uint32_t adc_periph, uint32_t st_time);
/* configure the self test watchdog timer */
void adc_selftest_watchdog_timer_config(uint32_t adc_periph, uint32_t st_sel, ControlStatus newvalue);
/* configure the self test registers lock state */
void adc_selftest_config_lock(uint32_t adc_periph, uint32_t state);

/* ADC loop test functions */
/* configure DAC to ADC loop test */
void adc_dac_looptest_config(uint32_t adc_periph, ControlStatus newvalue);
/* configure the DAC to ADC loop test threshold value */
void adc_dac_looptest_threshold_config(uint32_t adc_periph, uint32_t low_thl, uint32_t high_thl);
/* select which DAC used to loop test */
void adc_dac_looptest_dac_select(uint32_t adc_periph, uint32_t dac_select);

/* get ADC state functions */
/* get the ADC current state */
FlagStatus adc_current_state_get(uint32_t adc_periph, uint32_t state);
/* get the ADC current active sequence */
uint32_t adc_active_sequence_get(uint32_t adc_periph);
/* get the ADC which channel in conversion */
uint32_t adc_active_channel_get(uint32_t adc_periph);
/* get which channel converted this conversion data in channel register */
uint32_t adc_channel_converted_channel_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* get whether the previous conversion data was overwritten without read in channel register */
FlagStatus adc_channel_overwrite_status_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* get whether the new conversion data is available in channel register */
FlagStatus adc_channel_conversion_data_available_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* get which channel converted this conversion data in sequence register */
uint32_t adc_sequence_converted_channel_get(uint32_t adc_periph, uint32_t adc_sequence);
/* get whether the previous conversion data was overwritten without read in sequence register */
FlagStatus adc_sequence_overwrite_status_get(uint32_t adc_periph, uint32_t adc_sequence);
/* get whether the new conversion data is available in sequence register */
FlagStatus adc_sequence_conversion_data_available_get(uint32_t adc_periph, uint32_t adc_sequence);

