sorosaulong-ux/gd32-test-project/Library/gd32a7xx_adc.h
/* flag and interrupt functions */
/* get ADC flag */
FlagStatus adc_flag_get(uint32_t adc_periph, uint32_t flag);
/* get ADC error flag */
FlagStatus adc_error_flag_get(uint32_t adc_periph, uint32_t error_flag);
/* clear ADC flag */
void adc_flag_clear(uint32_t adc_periph, uint32_t flag);
/* clear ADC error flag */
void adc_error_flag_clear(uint32_t adc_periph, uint32_t error_flag);
/* enable ADC interrupt */
void adc_interrupt_enable(uint32_t adc_periph, uint32_t inserted_sequence, uint32_t interrupt);
/* disable ADC interrupt */
void adc_interrupt_disable(uint32_t adc_periph, uint32_t inserted_sequence, uint32_t interrupt);
/* get ADC interrupt flag */
FlagStatus adc_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag);
/* clear ADC interrupt flag */
void adc_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag);

/* get ADC sequence channel end of conversion flag */
FlagStatus adc_channel_flag_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* clear ADC sequence channel end of conversion flag */
void adc_channel_flag_clear(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* enable ADC sequence channel end of conversion interrupt */
void adc_channel_interrupt_enable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* disable ADC sequence channel end of conversion interrupt */
void adc_channel_interrupt_disable(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* get ADC sequence channel end of conversion interrupt flag */
FlagStatus adc_channel_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* clear ADC sequence channel end of conversion interrupt flag */
void adc_channel_interrupt_flag_clear(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);

/* get the ADC stream conversion complete flag */
FlagStatus adc_stream_flag_get(uint32_t adc_periph, uint32_t adc_sequence);
/* clear the ADC stream conversion complete flag */
void adc_stream_flag_clear(uint32_t adc_periph, uint32_t adc_sequence);
/* get the ADC stream conversion complete interrupt flag */
FlagStatus adc_stream_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_sequence);
/* clear the ADC stream conversion complete interrupt flag */
void adc_stream_interrupt_flag_clear(uint32_t adc_periph, uint32_t adc_sequence);

/* get ADC self test flag */
FlagStatus adc_selftest_flag_get(uint32_t adc_periph, uint32_t flag);
/* clear ADC selftest flag */
void adc_selftest_flag_clear(uint32_t adc_periph, uint32_t flag);
/* enable ADC self test interrupt */
void adc_selftest_interrupt_enable(uint32_t adc_periph, uint32_t interrupt);
/* disable ADC self test interrupt */
void adc_selftest_interrupt_disable(uint32_t adc_periph, uint32_t interrupt);
/* get ADC self test interrupt flag */
FlagStatus adc_selftest_interrupt_flag_get(uint32_t adc_periph, uint32_t int_flag);
/* clear ADC selftest interrupt flag */
void adc_selftest_interrupt_flag_clear(uint32_t adc_periph, uint32_t int_flag);

/* get ADC channel analog watchdog flag */
FlagStatus adc_channel_analog_watchdog_flag_get(uint32_t adc_periph, uint32_t adc_channel);
/* clear ADC channel analog watchdog flag */
void adc_channel_analog_watchdog_flag_clear(uint32_t adc_periph, uint32_t adc_channel);
/* get ADC channel analog watchdog interrupt flag */
FlagStatus adc_channel_analog_watchdog_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_channel);
/* clear ADC channel analog watchdog interrupt flag */
void adc_channel_analog_watchdog_interrupt_flag_clear(uint32_t adc_periph, uint32_t adc_channel);

/* get ADC sequence channel overwrite interrupt flag */
FlagStatus adc_channel_overwrite_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_sequence, uint32_t rank);
/* get the ADC sequence interrupt overwrite flag */
FlagStatus adc_overwrite_interrupt_flag_get(uint32_t adc_periph, uint32_t adc_sequence);
#endif /* GD32A7XX_ADC_H */
